In [244]:
#!pip3 install openai

import csv
import json
import openai
import os
import re
import time
import pandas as pd
import numpy as np

from os import path

openai.api_key = os.environ.get("OPENAI_API_KEY")

In [113]:
def get_schema(db_id):
    PATH = 'spider/database/'
    filename = 'schema.sql'
    
    path_to_file   = PATH + db_id + '/' + filename
    path_to_file_2 = PATH + db_id + '/' + db_id + '.sqlite'
    
    if path.exists(path_to_file): 
        return open(path_to_file, 'r').read()
    
    elif path.exists(path_to_file_2):
        return open(path_to_file_2, 'rb+').read()
    
    else:
        return None

def open_ai_prompt(x):
    return f'''Convert text to SQL.
        You have the following DDLs:
        ```
        {x['schema']}
        ```
        Write the SQL that answers the following question:
        """{x['question']}"""
        Respond with only one concise SQL statement.'''

def open_ai_completion(x):
    return f" {x['query']}\n"

def splitter(x: str):
    try:
        arr = x.split(';')
        create_tables = []
        for i, stmt in enumerate(arr):
            stmt = stmt.strip()
            if stmt.lower().startswith('create'):
                create_tables.append(stmt.replace('IF NOT EXISTS ', '').replace('\n', ''))
    except:
        arr = x.split(b';')
        create_tables = []
        for i, stmt in enumerate(arr):
            stmt = stmt.strip()
            if stmt.lower().startswith(b'create'):
                create_tables.append(stmt.replace('IF NOT EXISTS ', '').replace('\n', ''))
 
    return ';'.join(create_tables)

In [114]:
# Read in the first 100 Spider trining examples
df = pd.read_json('spider/train_spider.json')
df = df[['question', 'db_id', 'query']].head(100)

df['schema']         = df.apply(lambda x: get_schema(x['db_id']), axis=1)
df['schema']         = df['schema'].apply(splitter)
df['open_ai_prompt'] = df.apply(lambda x: open_ai_prompt(x), axis=1)
df['open_ai_completion'] = df.apply(lambda x: open_ai_completion(x), axis=1)
df.head()

,question,db_id,query,schema,open_ai_prompt,open_ai_completion
0,How many heads of the departments are older th...,department_management,SELECT count(*) FROM head WHERE age > 56,"CREATE TABLE ""department"" (""Department_ID"" int...",Convert text to SQL.\n You have the fol...,SELECT count(*) FROM head WHERE age > 56\n
1,"List the name, born state and age of the heads...",department_management,"SELECT name , born_state , age FROM head ORD...","CREATE TABLE ""department"" (""Department_ID"" int...",Convert text to SQL.\n You have the fol...,"SELECT name , born_state , age FROM head OR..."
2,"List the creation year, name and budget of eac...",department_management,"SELECT creation , name , budget_in_billions ...","CREATE TABLE ""department"" (""Department_ID"" int...",Convert text to SQL.\n You have the fol...,"SELECT creation , name , budget_in_billions..."
3,What are the maximum and minimum budget of the...,department_management,"SELECT max(budget_in_billions) , min(budget_i...","CREATE TABLE ""department"" (""Department_ID"" int...",Convert text to SQL.\n You have the fol...,"SELECT max(budget_in_billions) , min(budget_..."
4,What is the average number of employees of the...,department_management,SELECT avg(num_employees) FROM department WHER...,"CREATE TABLE ""department"" (""Department_ID"" int...",Convert text to SQL.\n You have the fol...,SELECT avg(num_employees) FROM department WHE...

# Pre-Fine Tuning
First, let's try explaining the problem to Da Vinci in English and see how it does on 100 Spider examples.

This gives the exact right answer 28% of the time.

In [166]:
davinci_raw = df[['open_ai_prompt','open_ai_completion']].copy().tail(90)

def call_davinci(row):
    prompt = row["open_ai_prompt"]
    
    # parameters chosen to match OpenAI Playground
    completions = openai.Completion.create(
        engine="text-davinci-003",
        prompt=prompt,
        max_tokens=256,
        stop=None,
        temperature=0.7,
        top_p=1,
        frequency_penalty=0,
        presence_penalty=0
    )
    
    print(completions.choices[0].text.rstrip(";"))
    return completions.choices[0].text.rstrip(";")

davinci_raw["model_response"] = "" 
davinci_raw["model_response"] = davinci_raw.apply(call_davinci, axis=1)

davinci_raw['correct'] = np.where(davinci_raw['open_ai_completion'].str.strip().str.lower().apply(lambda x: re.sub('\s+', '',x)) ==
                                  davinci_raw['model_response'].str.strip().str.lower().apply(lambda x: re.sub('\s+', '',x)), 1, 0)

SELECT COUNT(DISTINCT temporary_acting) FROM management


SELECT COUNT(*) FROM department d LEFT JOIN management m ON d.Department_ID = m.Department_ID WHERE m.head_ID IS NULL


SELECT DISTINCT age FROM head JOIN management ON head.head_ID = management.head_ID WHERE temporary_acting = 'yes'


SELECT born_state
FROM head
INNER JOIN management
ON head.head_ID = management.head_ID
INNER JOIN department
ON management.department_ID = department.department_ID
WHERE department.name IN ('Treasury', 'Homeland Security')


SELECT Department_ID, Name, COUNT(head_ID) AS Num_Heads FROM department INNER JOIN management ON Department_ID = department_ID GROUP BY Department_ID, Name HAVING COUNT(head_ID) > 1


SELECT head_ID, name FROM head WHERE name LIKE '%Ha%'


SELECT COUNT(*) FROM farm


SELECT COUNT(*) FROM farm


SELECT SUM(Total_Horses) FROM farm ORDER BY SUM(Total_Horses) ASC


SELECT Farm_ID, SUM(Total_Horses) AS Total_Horses_Record FROM farm GROUP BY Farm_ID ORDER BY Total_Horses_Record ASC


SELECT Hosts FROM farm_competition WHERE Theme != 'Aliens'


SELECT Hosts
FROM farm_competition
WHERE Theme != 'Aliens'


SELECT Theme, Year FROM farm_competition ORDER BY Year ASC


SELECT Theme FROM farm_competition ORDER BY Year ASC


SELECT AVG(Working_Horses) FROM farm WHERE Total_Horses > 5000


SELECT AVG(Working_Horses) FROM farm WHERE Total_Horses > 5000


SELECT MAX(Cows) AS Maximum_Cows, MIN(Cows) AS Minimum_Cows FROM farm


SELECT MAX(Cows) AS Maximum_Cows, MIN(Cows) AS Minimum_Cows FROM farm


SELECT COUNT(DISTINCT Status) FROM city


SELECT COUNT(DISTINCT Status) FROM city


SELECT Official_Name FROM city ORDER BY Population DESC


SELECT Official_Name
FROM city
ORDER BY Population DESC


SELECT Official_Name, Status FROM city WHERE Population = (SELECT MAX(Population) FROM city)


SELECT Official_Name, Status FROM city WHERE Population = (SELECT MAX(Population) FROM city)


SELECT `Year`, `Official_Name` FROM `farm_competition`
INNER JOIN `city` ON `farm_competition`.`Host_city_ID` = `city`.`City_ID`


SELECT c.Year, c.Official_Name FROM city c INNER JOIN farm_competition fc ON c.City_ID = fc.Host_city_ID


SELECT Official_Name
FROM city
WHERE City_ID IN (SELECT Host_city_ID
                   FROM farm_competition
                   GROUP BY Host_city_ID
                   HAVING COUNT(*) > 1)


SELECT Official_Name FROM city c JOIN farm_competition fc ON fc.Host_city_ID = c.City_ID GROUP BY Official_Name HAVING COUNT(Competition_ID) > 1


SELECT Status FROM city c
INNER JOIN farm_competition fc ON fc.Host_city_ID = c.City_ID
GROUP BY c.City_ID
ORDER BY COUNT(fc.Competition_ID) DESC
LIMIT 1


SELECT Status FROM city WHERE City_ID=(SELECT Host_city_ID FROM farm_competition GROUP BY Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1)


SELECT Theme FROM farm_competition fc
INNER JOIN city c ON fc.Host_city_ID = c.City_ID
WHERE c.Population > 1000


SELECT Theme FROM farm_competition
INNER JOIN city ON farm_competition.Host_city_ID = city.City_ID
WHERE city.Population > 1000


SELECT Status, AVG(Population) AS Average_Population FROM city GROUP BY Status


SELECT Status, AVG(Population) AS Average_Population FROM city GROUP BY Status


SELECT Status, COUNT(Status) FROM city GROUP BY Status ORDER BY COUNT(Status) ASC


SELECT "Status", COUNT("Status") AS Frequency FROM "city" GROUP BY "Status" ORDER BY Frequency ASC


SELECT Status, COUNT(*) AS Frequency FROM city GROUP BY Status ORDER BY Frequency DESC LIMIT 1


SELECT Status, COUNT(*) as Frequency FROM city GROUP BY Status ORDER BY Frequency DESC LIMIT 1


SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)


SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)


SELECT Status
FROM city
WHERE Population > 1500 AND Population < 500


SELECT Status FROM city WHERE Population > 1500 OR Population < 500


SELECT Official_Name FROM city WHERE Population > 1500 OR Population < 500


SELECT Official_Name FROM city WHERE Population > 1500 OR Population < 500


SELECT Official_Name, Census_Ranking FROM city WHERE Status <> 'Village'


SELECT Official_Name, Census_Ranking FROM city WHERE Status != 'Village'


SELECT course_name, COUNT(student_id) AS num_students
FROM Courses
INNER JOIN Student_Course_Registrations
ON Courses.course_id = Student_Course_Registrations.course_id
GROUP BY course_name
ORDER BY num_students DESC
LIMIT 1


SELECT course_name
FROM Courses
INNER JOIN Student_Course_Registrations
ON Courses.course_id = Student_Course_Registrations.course_id
GROUP BY course_name
ORDER BY COUNT(*) DESC
LIMIT 1


SELECT student_id FROM Student_Course_Registrations GROUP BY student_id HAVING COUNT(*) = (SELECT MIN(num_courses) FROM (SELECT student_id, COUNT(*) as num_courses FROM Student_Course_Registrations GROUP BY student_id) as course_counts)


SELECT student_id
FROM Student_Course_Registrations
GROUP BY student_id
HAVING COUNT(student_id) = (SELECT MIN(cnt) FROM (SELECT COUNT(student_id) AS cnt FROM Student_Course_Registrations GROUP BY student_id) AS cnts)


SELECT first_name, last_name FROM People INNER JOIN Candidates ON People.person_id = Candidates.candidate_id


SELECT first_name, last_name FROM People JOIN Candidates ON People.person_id = Candidates.candidate_id


SELECT student_id
FROM Students
WHERE student_id NOT IN (SELECT student_id FROM Student_Course_Attendance)


SELECT student_id FROM Students WHERE student_id NOT IN (SELECT student_id FROM Student_Course_Attendance)


SELECT student_id FROM Student_Course_Attendance


SELECT student_id FROM Student_Course_Attendance


SELECT Students.student_id, Courses.course_name
FROM Students
INNER JOIN Student_Course_Registrations
ON Students.student_id = Student_Course_Registrations.student_id
INNER JOIN Courses
ON Student_Course_Registrations.course_id = Courses.course_id


SELECT first_name,middle_name,last_name,cell_mobile_number,email_address,login_name,password FROM People INNER JOIN Students ON People.person_id = Students.student_id INNER JOIN Student_Course_Registrations ON Students.student_id = Student_Course_Registrations.student_id ORDER BY registration_date DESC LIMIT 1


SELECT Students.student_id, Students.student_details, Courses.course_id, Courses.course_name, Student_Course_Registrations.registration_date
FROM Students
INNER JOIN Student_Course_Registrations ON Students.student_id = Student_Course_Registrations.student_id
INNER JOIN Courses ON Student_Course_Registrations.course_id = Courses.course_id
ORDER BY Student_Course_Registrations.registration_date DESC


SELECT COUNT(*) FROM Student_Course_Attendance WHERE course_id = (SELECT course_id FROM Courses WHERE course_name = 'English')


SELECT COUNT(*) FROM Student_Course_Attendance AS SCA JOIN Courses AS C ON SCA.course_id = C.course_id WHERE C.course_name = 'English'


SELECT COUNT(*) FROM Student_Course_Registrations WHERE student_id=171


SELECT COUNT(*) FROM Student_Course_Registrations WHERE student_id = 171


SELECT candidate_id FROM People INNER JOIN Candidates ON People.person_id = Candidates.candidate_id WHERE email_address = 'stanley.monahan@example.org'


SELECT candidate_id FROM Candidates INNER JOIN People ON Candidates.candidate_id=People.person_id WHERE email_address='stanley.monahan@example.org'


SELECT candidate_id FROM Candidate_Assessments ORDER BY assessment_date DESC LIMIT 1


SELECT candidate_id FROM Candidate_Assessments ORDER BY assessment_date DESC LIMIT 1


SELECT s.student_id, s.student_details, COUNT(*) AS Course_Count
FROM Students s
INNER JOIN Student_Course_Registrations scr ON s.student_id = scr.student_id
GROUP BY s.student_id, s.student_details
ORDER BY Course_Count DESC
LIMIT 1


SELECT first_name, middle_name, last_name, cell_mobile_number, email_address, login_name, password
FROM People
INNER JOIN Students ON People.person_id = Students.student_id
INNER JOIN Student_Course_Registrations ON Students.student_id = Student_Course_Registrations.student_id
GROUP BY Students.student_id
ORDER BY COUNT(*) DESC
LIMIT 1


SELECT student_id, COUNT(*) AS registered_courses FROM Student_Course_Registrations GROUP BY student_id


SELECT COUNT(course_id)
FROM Student_Course_Registrations
GROUP BY student_id

SELECT c.course_name, COUNT(s.student_id) AS 'Number of Registered Students'
FROM Courses c
INNER JOIN Student_Course_Registrations scr ON c.course_id = scr.course_id
INNER JOIN Students s ON s.student_id = scr.student_id
GROUP BY c.course_name


SELECT COUNT(Student_Course_Registrations.student_id),Courses.course_name
FROM Student_Course_Registrations
INNER JOIN Courses ON Student_Course_Registrations.course_id = Courses.course_id
GROUP BY Courses.course_id


SELECT candidate_id FROM Candidate_Assessments WHERE asessment_outcome_code = 'Pass'


SELECT candidate_id FROM Candidate_Assessments WHERE asessment_outcome_code = 'Pass'


SELECT cell_mobile_number
FROM People
INNER JOIN Candidates
ON People.person_id = Candidates.candidate_id
INNER JOIN Candidate_Assessments
ON Candidates.candidate_id = Candidate_Assessments.candidate_id
WHERE assessment_outcome_code = 'Fail'


SELECT cell_mobile_number
FROM People
INNER JOIN Candidates
ON People.person_id = Candidates.candidate_id
INNER JOIN Candidate_Assessments
ON Candidates.candidate_id = Candidate_Assessments.candidate_id
WHERE assessment_outcome_code = 'Fail'


SELECT student_id FROM Student_Course_Registrations WHERE course_id = '301'


SELECT student_id
FROM Student_Course_Registrations
WHERE course_id = '301'


SELECT student_id FROM Student_Course_Registrations WHERE course_id = 301 ORDER BY registration_date DESC LIMIT 1


SELECT student_id
FROM Student_Course_Registrations
WHERE course_id = '301'
ORDER BY registration_date DESC
LIMIT 1


SELECT DISTINCT city FROM Addresses


SELECT DISTINCT city
FROM Addresses
INNER JOIN People_Addresses
ON Addresses.address_id = People_Addresses.address_id


SELECT DISTINCT city FROM Addresses a
INNER JOIN People_Addresses pa ON a.address_id = pa.address_id
INNER JOIN Students s ON s.student_id = pa.person_id


SELECT DISTINCT a.city
FROM Addresses a
INNER JOIN People_Addresses pa ON a.address_id = pa.address_id
INNER JOIN People p ON pa.person_id = p.person_id
INNER JOIN Students s ON s.student_id = p.person_id


SELECT course_name FROM Courses ORDER BY course_name ASC


SELECT course_name FROM Courses ORDER BY course_name ASC


SELECT first_name FROM People ORDER BY first_name ASC


SELECT first_name FROM People ORDER BY first_name ASC


SELECT student_id FROM Student_Course_Registrations UNION SELECT student_id FROM Student_Course_Attendance

In [167]:
# Correct on 4 of the first 10 queries
# Correct on 24 of the next 90 queries
# 28% accuracy
davinci_raw['correct'].mean()

0.26666666666666666

In [204]:
davinci_raw.iloc[0]['open_ai_prompt']

'Convert text to SQL.\n        You have the following DDLs:\n        ```\n        CREATE TABLE "department" ("Department_ID" int,"Name" text,"Creation" text,"Ranking" int,"Budget_in_Billions" real,"Num_Employees" real,PRIMARY KEY ("Department_ID"));CREATE TABLE "head" ("head_ID" int,"name" text,"born_state" text,"age" real,PRIMARY KEY ("head_ID"));CREATE TABLE "management" ("department_ID" int,"head_ID" int,"temporary_acting" text,PRIMARY KEY ("Department_ID","head_ID"),FOREIGN KEY ("Department_ID") REFERENCES `department`("Department_ID"),FOREIGN KEY ("head_ID") REFERENCES `head`("head_ID"))\n        ```\n        Write the SQL that answers the following question:\n        """How many acting statuses are there?"""\n        Respond with only one concise SQL statement.'

In [202]:
print(davinci_raw.iloc[0]['open_ai_completion'])
print(davinci_raw.iloc[0]['model_response'])

 SELECT count(DISTINCT temporary_acting) FROM management



SELECT COUNT(DISTINCT temporary_acting) FROM management

In [168]:
davinci_raw[davinci_raw['correct'] == 0]

,open_ai_prompt,open_ai_completion,model_response,correct
11,Convert text to SQL.\n You have the fol...,SELECT count(*) FROM department WHERE departm...,\n\nSELECT COUNT(*) FROM department d LEFT JOI...,0
12,Convert text to SQL.\n You have the fol...,SELECT DISTINCT T1.age FROM management AS T2 ...,\n\nSELECT DISTINCT age FROM head JOIN managem...,0
13,Convert text to SQL.\n You have the fol...,SELECT T3.born_state FROM department AS T1 JO...,\n\nSELECT born_state\nFROM head\nINNER JOIN m...,0
14,Convert text to SQL.\n You have the fol...,"SELECT T1.department_id , T1.name , count(*...","\n\nSELECT Department_ID, Name, COUNT(head_ID)...",0
18,Convert text to SQL.\n You have the fol...,SELECT Total_Horses FROM farm ORDER BY Total_...,\n\nSELECT SUM(Total_Horses) FROM farm ORDER B...,0
...,...,...,...,...
94,Convert text to SQL.\n You have the fol...,SELECT DISTINCT T1.city FROM addresses AS T1 ...,\n\nSELECT DISTINCT a.city\nFROM Addresses a\n...,0
95,Convert text to SQL.\n You have the fol...,SELECT course_name FROM courses ORDER BY cour...,\n\nSELECT course_name FROM Courses ORDER BY c...,0
96,Convert text to SQL.\n You have the fol...,SELECT course_name FROM courses ORDER BY cour...,\n\nSELECT course_name FROM Courses ORDER BY c...,0
97,Convert text to SQL.\n You have the fol...,SELECT first_name FROM people ORDER BY first_...,\n\nSELECT first_name FROM People ORDER BY fir...,0
98,Convert text to SQL.\n You have the fol...,SELECT first_name FROM people ORDER BY first_...,\n\nSELECT first_name FROM People ORDER BY fir...,0

In [170]:
print(re.sub('\s+', '', davinci_raw.loc[11]['open_ai_completion'].strip().lower()))
print(re.sub('\s+', '', davinci_raw.loc[11]['model_response'].strip().lower()))

selectcount(*)fromdepartmentwheredepartment_idnotin(selectdepartment_idfrommanagement);
selectcount(*)fromdepartmentdleftjoinmanagementmond.department_id=m.department_idwherem.head_idisnull

In [337]:
tmp = davinci_raw[~davinci_raw['open_ai_completion'].str.contains('JOIN')].copy()
print(tmp.shape)
print(tmp['correct'].mean())

(54, 4)
0.4444444444444444

In [345]:
i = 2
print(tmp[tmp['correct'] == 0].iloc[i]['open_ai_prompt'])
print(tmp[tmp['correct'] == 0].iloc[i]['open_ai_completion'])
print(tmp[tmp['correct'] == 0].iloc[i]['model_response'])

Convert text to SQL.
        You have the following DDLs:
        ```
        CREATE TABLE "city" ("City_ID" int,"Official_Name" text,"Status" text,"Area_km_2" real,"Population" real,"Census_Ranking" text,PRIMARY KEY ("City_ID"));CREATE TABLE "farm" ("Farm_ID" int,"Year" int,"Total_Horses" real,"Working_Horses" real,"Total_Cattle" real,"Oxen" real,"Bulls" real,"Cows" real,"Pigs" real,"Sheep_and_Goats" real,PRIMARY KEY ("Farm_ID"));CREATE TABLE "farm_competition" ("Competition_ID" int,"Year" int,"Theme" text,"Host_city_ID" int,"Hosts" text,PRIMARY KEY ("Competition_ID"),FOREIGN KEY (`Host_city_ID`) REFERENCES `city`(`City_ID`));CREATE TABLE "competition_record" ("Competition_ID" int,"Farm_ID" int,"Rank" int,PRIMARY KEY ("Competition_ID","Farm_ID"),FOREIGN KEY (`Competition_ID`) REFERENCES `farm_competition`(`Competition_ID`),FOREIGN KEY (`Farm_ID`) REFERENCES `farm`(`Farm_ID`))
        ```
        Write the SQL that answers the following question:
        """What is the total horses record for each farm, sorted ascending?"""
        Respond with only one concise SQL statement.
 SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC



SELECT Farm_ID, SUM(Total_Horses) AS Total_Horses_Record FROM farm GROUP BY Farm_ID ORDER BY Total_Horses_Record ASC

# Fine Tune Da Vinci
Start with the same prompt as above

It's right in sample 12% of the time.
It's right out of sample 12% of the time.

How can those be exactly the same? And worse than the model without fine tuning?

In [ ]:
# data = []
# for idx, row in df.iterrows():
#     data.append({"prompt": row["open_ai_prompt"], "completion": row["open_ai_completion"]})

# with open("spider_open_ai_fine_tuning.jsonl", "w") as outfile:
#     for obj in data:
#         json.dump(obj, outfile)
#         outfile.write("\n")

In [183]:
#!openai tools fine_tunes.prepare_data -f spider_open_ai_fine_tuning.jsonl

Advice from OpenAI's prepare_data function:  
-For conditional generation, and for classification the examples shouldn't be longer than 2048 tokens.  
-All prompts end with suffix...This suffix seems very long. Consider replacing with a shorter suffix, such as `\n\n###\n\n`  
-All prompts start with prefix...Fine-tuning doesn't require the instruction specifying the task, or a few-shot example scenario. Most of the time you should only add the input data into the prompt, and the desired output into the completion  
-Make sure to include `stop=["\n"]` so that the generated texts ends at the expected place.

In [ ]:
#!openai api fine_tunes.create -t "spider_open_ai_fine_tuning.jsonl" -m davinci

## In-Sample Testing

In [172]:
# model davinci:ft-mercator-2023-01-13-21-03-38 is trained on 100 prompts in long format with uncleaned schema
# testing here on the same data, but with the cleaned schema

df_is = df[['open_ai_prompt','open_ai_completion']].copy()

df_is["model_response"] = ""

def call_model_long_prompt(row):
    prompt = row["open_ai_prompt"]
    
    completions = openai.Completion.create(
        engine="davinci:ft-mercator-2023-01-13-21-03-38",
        prompt=prompt,
        max_tokens=1024,
        n=1,
        stop=["\n"],
        temperature=0.5
    )
    
    print(completions.choices[0].text)
    return completions.choices[0].text
    
df_is["model_response"] = df_is.apply(call_model_long_prompt, axis=1)

     SELECT count(*) FROM management WHERE age  >  56





     SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T3.born_state  =  'Alabama'







      SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1







     SELECT Theme FROM farm_competition ORDER BY YEAR ASC


     SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000

     SELECT max(Cows) ,  min(Cows) FROM farm





     SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1

      SELECT T2.Year , T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID
     SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1
        SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1




     SELECT Status ,  avg(Population) FROM city GROUP BY Status

     SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC









      SELECT Census_Ranking FROM city WHERE Status !=  "Village"






        SELECT first_name ,  last_name FROM Candidates
        """SELECT student_id FROM Student_Course_Attendance WHERE student_id NOT IN (SELECT student_id FROM Student_Course_Registrations);"""
        """SELECT student_id FROM Student_Course_Attendance WHERE  course_id  !=  ANY  (SELECT course_id FROM Courses)"""

        SELECT student_id FROM Student_Course_Attendance WHERE course_id  IN (SELECT course_id FROM Courses WHERE date_of_attendance  IN (SELECT date_of_attendance FROM Student_Course_Attendance GROUP BY date_of_attendance HAVING count(*)  >  1))

     SELECT T1.detail FROM Students AS T1 JOIN Student_Course_Registrations AS T2 ON T1.student_id  =  T2.student_id WHERE T2.registration_date  =  DATES_DOPENDING(NOW(), INTERVAL 1 DAY)

     SELECT count(*) FROM Student_Course_Attendance WHERE course_id = 'English'
     SELECT count(*) FROM Student_Course_Attendance WHERE course_id = 'ENGLISH'
     SELECT count(*) FROM Student_Course_Attendance WHERE student_id = 171
     SELECT count(*) FROM Student_Course_Attendance WHERE student_id = 171


     SELECT max(student_id) FROM Student_Course_Registrations
        SELECT max(candidate_id) FROM Candidate_Course_Registrations

      SELECT count(*) FROM Student_Course_Registrations WHERE count(*) =  count(*)


       SELECT course_name , count(*) FROM Student_Course_Registrations GROUP BY course_name
        SELECT count(*) FROM Student_Course_Registrations WHERE course_id = ?"

        Write the SQL that answers the following question:        """What are the ids of the candidates that have an outcome code of Fail?"""        Respond with only one concise SQL statement.        Write the SQL that answers the following question:        """What are the ids of the candidates that have an outcome code of Pass or Fail?"""        Respond with only one concise SQL statement.        Write the SQL that answers the following question:        """What are the ids of the candidates that have an outcome code of Pass, Fail or        Unknown?"""        Respond with only one concise SQL statement.        Write the SQL that answers the following question:        """What are the
        """SELECT cell_mobile_number FROM Candidate_Assessments WHERE assessment_outcome_code = 'Fail'"""
        SELECT cell_mobile_number FROM Student_Course_Registrations WHERE assessment_outcome_code = 'Fail'
        Write it in the box below.         SELECT student_id FROM Student_Course_Registrations WHERE course_id = 301

        SELECT student_id FROM Student_Course_Registrations WHERE registration_date        IS         MOST RECENT

        """SELECT DISTINCT city FROM Addresses WHERE address_id IN (SELECT address_id FROM People GROUP BY city HAVING COUNT(*)  !=  1)"""
      SELECT city FROM Addresses
     SELECT DISTINCT city FROM Addresses WHERE student_id  IN  (SELECT student_id FROM Students)
      SELECT city FROM Students

     SELECT course_name FROM courses ORDER BY course_name ASC
      SELECT first_name FROM People ORDER BY first_name ASC
     SELECT first_name FROM People ORDER BY first_name ASC
        SELECT student_id FROM Student_Course_Registrations JOIN Student_Course_Attendance ON T1.student_id  =  T2.student_id WHERE T1.registration_date  =  T2.date_of_attendance

In [177]:
df_is['correct'] = np.where(df_is['open_ai_completion'].str
                                                       .strip()
                                                       .str
                                                       .lower()
                                                       .apply(lambda x: re.sub('\s+', '',x)) == 
                            df_is['model_response'].str
                                                   .strip()
                                                   .str
                                                   .lower()
                                                   .apply(lambda x: re.sub('\s+', '',x)), 1, 0)
print(df_is['correct'].mean())

0.12

In [178]:
df_is_wrong = df_is[df_is['correct'] == 0].copy().reset_index()

i = 0
# print(df_is_wrong.loc[i]['open_ai_prompt'])
print(df_is_wrong.loc[i]['open_ai_completion'])
print(df_is_wrong.loc[i]['model_response'])

 SELECT count(*) FROM head WHERE age  >  56

     SELECT count(*) FROM management WHERE age  >  56

## Out-of-Sample Testing

In [180]:
df_oos = pd.read_json('spider/train_spider.json')
df_oos = df_oos[['question', 'db_id', 'query']].tail(100)

df_oos['schema']         = df_oos.apply(lambda x: get_schema(x['db_id']), axis=1)
df_oos['schema']         = df_oos['schema'].apply(splitter)
df_oos['open_ai_prompt'] = df_oos.apply(lambda x: open_ai_prompt(x), axis=1)
df_oos['open_ai_completion'] = df_oos.apply(lambda x: open_ai_completion(x), axis=1)
df_oos.head()

,question,db_id,query,schema,open_ai_prompt,open_ai_completion
6900,Find the id of the customer who made the most ...,tracking_orders,SELECT T1.customer_id FROM customers AS T1 JOI...,CREATE TABLE `Customers` (`customer_id` INTEGE...,Convert text to SQL.\n You have the fol...,SELECT T1.customer_id FROM customers AS T1 JO...
6901,Give me a list of id and status of orders whic...,tracking_orders,"SELECT T2.order_id , T2.order_status FROM cus...",CREATE TABLE `Customers` (`customer_id` INTEGE...,Convert text to SQL.\n You have the fol...,"SELECT T2.order_id , T2.order_status FROM cu..."
6902,"Which orders are made by the customer named ""J...",tracking_orders,"SELECT T2.order_id , T2.order_status FROM cus...",CREATE TABLE `Customers` (`customer_id` INTEGE...,Convert text to SQL.\n You have the fol...,"SELECT T2.order_id , T2.order_status FROM cu..."
6903,Find the dates of orders which belong to the c...,tracking_orders,SELECT T2.date_order_placed FROM customers AS ...,CREATE TABLE `Customers` (`customer_id` INTEGE...,Convert text to SQL.\n You have the fol...,SELECT T2.date_order_placed FROM customers AS...
6904,What are the dates of the orders made by the c...,tracking_orders,SELECT T2.date_order_placed FROM customers AS ...,CREATE TABLE `Customers` (`customer_id` INTEGE...,Convert text to SQL.\n You have the fol...,SELECT T2.date_order_placed FROM customers AS...

In [181]:
df_oos["model_response"] = ""
df_oos["model_response"] = df_oos.apply(call_model_long_prompt, axis=1)

df_oos['correct'] = np.where(df_oos['open_ai_completion'].str
                                                         .strip()
                                                         .str
                                                         .lower()
                                                         .apply(lambda x: re.sub('\s+', '',x)) == 
                             df_oos['model_response'].str
                                                     .strip()
                                                     .str
                                                     .lower()
                                                     .apply(lambda x: re.sub('\s+', '',x)), 1, 0)
print(df_oos['correct'].mean())

      SELECT order_id , order_status FROM orders WHERE customer_id = 'Jeramie'



    """


      SELECT DISTINCT product_id FROM orders WHERE order_date BETWEEN '1975-01-01' AND '1976-01-01'






     SELECT date_order_placed FROM orders WHERE invoice_number = 10

     SELECT count(DISTINCT product_id) FROM orders GROUP BY product_id









     SELECT DISTINCT order_id FROM orders ORDER BY date_order_placed

     SELECT max(order_item_count) FROM orders

















     SELECT max(length_meters) FROM bridge JOIN architect ON bridge.architect_id  =  architect.id
     SELECT avg(length_feet) FROM bridge
     SELECT name ,  built_year FROM mill WHERE type = 'Grondzeiler'
        """SELECT DISTINCT T1.name , T1.nationality FROM architect AS T1 JOIN mill AS T2 ON T1.id  =  T2.architect_id GROUP BY T1.name , T1.nationality HAVING COUNT(*)  !=  2""

     SELECT DISTINCT T1.type FROM mill AS T1 JOIN architect AS T2 ON T1.architect_id  =  T2.id WHERE T2.nationality  =  'American' OR T2.nationality  =  'Canadian'
        ```sql

      SELECT T1.id , T1.name , T1.gender FROM architect AS T1 JOIN bridge AS T2 ON T1.id  =  T2.architect_id WHERE T2.id  IN  ( SELECT T3.id FROM bridge AS T3 WHERE T3.id  IN  ( SELECT T4.id FROM mill AS T4 WHERE T4.id  IN  ( SELECT T5.id FROM bridge AS T5 WHERE T5.id  IN  ( SELECT T6.id FROM mill AS T6 WHERE T6.id  IN  ( SELECT T7.id FROM mill AS T7 WHERE T7.id  IN  ( SELECT T8.id FROM mill AS T8 WHERE T8.id  IN  ( SELECT T9.id FROM mill AS T9 WHERE T9.id  IN  ( SELECT T10.id FROM mill AS T10 WHERE T10.id  IN  ( SELECT T11.id FROM mill AS T11 WHERE T11.id  IN  ( SELECT T12.id FROM mill AS T12 WHERE T12.id  IN  ( SELECT T13.id FROM mill AS T13 WHERE T13.id  IN  ( SELECT T14.id FROM mill AS T14 WHERE T14.id  IN  ( SELECT T15.id FROM mill AS T15 WHERE T15.id  IN  ( SELECT T16.id FROM mill AS T16 WHERE T16.id  IN  ( SELECT T17.id FROM mill AS T17 WHERE T17.id  IN  ( SELECT T18.id FROM mill AS T18 WHERE T18.id  IN  ( SELECT T19.id FROM mill AS T19 WHERE T19.id  IN  ( SELECT T20.id FROM mill AS T20 WHERE T20.id  IN  ( SELECT T21.id FROM mill AS T21 WHERE T21.id  IN  ( SELECT T22.id FROM mill AS T22 WHERE T22.id  IN  ( SELECT T23.id FROM mill AS T23 WHERE T23.id  IN  ( SELECT T24.id FROM mill AS T24 WHERE T24.id  IN  ( SELECT T25.id FROM mill AS T25 WHERE T25.id  IN  ( SELECT T26.id FROM mill AS T26 WHERE T26.id  IN  ( SELECT T27.id FROM mill AS T27 WHERE T27.id  IN  ( SELECT T28.id FROM mill AS T28 WHERE T28.id  IN  ( SELECT T29.id FROM mill AS T29 WHERE T29.id  IN  ( SELECT T30.id FROM mill AS T30 WHERE T30.id  IN  ( SELECT T31.id FROM mill AS T31 WHERE T31.id  IN  ( SELECT T32.id FROM mill AS T32 WHERE T32.id  IN  ( SELECT T33.id FROM mill AS T33 WHERE T33.id  IN  ( SELECT T34.id FROM mill AS T34 WHERE T34.id  IN  ( SELECT T35.id FROM mill AS T35 WHERE T35.id  IN  ( SELECT T36.id FROM mill AS T36 WHERE T36.id  IN  ( SELECT T37.id FROM mill AS T37 WHERE T37.id  IN  ( SELECT T38.id FROM mill AS T38 WHERE T38.id  IN  ( SELECT T39.id FROM mill AS T39 WHERE T39.id  IN   ]);]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]];]);
        """location""    FROM "bridge" WHERE  name  LIKE  'Kolob Arch' OR  name  LIKE  'Rainbow Bridge'


     SELECT type ,  count(*) FROM mill GROUP BY type ORDER BY count(*) DESC LIMIT 1
        SELECT count(*) FROM architect WHERE built_year  <  1850




      SELECT Book_Title ,  Author_or_Editor FROM book_club WHERE Year  >  1989

     SELECT DISTINCT Publisher FROM book_club
      SELECT Year ,  Book_Title ,  Publisher FROM book_club ORDER BY YEAR DESC


     SELECT T1.Publisher ,  T1.Book_Title ,  count(*) FROM book_club AS T1 JOIN culture_company AS T2 ON T1.Publisher  =  T2.Publisher GROUP BY T1.Publisher

    SELECT publisher FROM book_club GROUP BY publisher ORDER BY count(*) DESC LIMIT 1


      SELECT Category FROM book_club WHERE count(*)  >  2


     SELECT publisher FROM book_club WHERE book_title LIKE '%1989%' INTERSECT SELECT publisher FROM book_club WHERE book_title LIKE '%1990%'
        SELECT Publisher FROM book_club WHERE Year != 1989


      SELECT Title ,  YEAR ,  DIRECTOR FROM movie ORDER BY budget_million

     SELECT count(DISTINCT Director) FROM movie

      SELECT Title ,  Director FROM movie WHERE Year  =  2000 OR Year  =  EARLIER GROUP BY Title ORDER BY Gross_worldwide DESC LIMIT 1
      SELECT Director FROM movie WHERE Director IN ( SELECT Director FROM movie WHERE Year = 1999 OR Year = 2000 )



      SELECT avg(budget_million), max(budget_million), min(budget_million) FROM movie WHERE year  <  2000
      SELECT avg(budget_million), max(budget_million), min(budget_million) FROM movie WHERE Year <= 2000

     SELECT Company_name FROM culture_company WHERE book_club_id  =          T1
      SELECT T1.Title FROM book_club AS T1 JOIN culture_company AS T2 ON T1.book_club_id  =  T2.book_club_id WHERE T2.Type  =  'China'

      SELECT T1.Company_name FROM culture_company AS T1 JOIN movie AS T2 ON T1.company_id  =  T2.company_id WHERE T2.Year  =  1999

0.12

In [184]:
df_oos_wrong = df_oos[df_oos['correct'] == 0].copy().reset_index()

i = 0
print(df_oos_wrong.loc[i]['open_ai_prompt'])
print(df_oos_wrong.loc[i]['open_ai_completion'])
print(df_oos_wrong.loc[i]['model_response'])

Convert text to SQL.
        You have the following DDLs:
        ```
        CREATE TABLE `Customers` (`customer_id` INTEGER PRIMARY KEY,`customer_name` VARCHAR(80),`customer_details` VARCHAR(255));CREATE TABLE `Invoices` (`invoice_number` INTEGER PRIMARY KEY,`invoice_date` DATETIME,`invoice_details` VARCHAR(255));CREATE TABLE `Orders` (`order_id` INTEGER PRIMARY KEY,`customer_id` INTEGER NOT NULL,`order_status` VARCHAR(10) NOT NULL,`date_order_placed` DATETIME NOT NULL,`order_details` VARCHAR(255),FOREIGN KEY (`customer_id` ) REFERENCES `Customers`(`customer_id` ));CREATE TABLE `Products` (`product_id` INTEGER PRIMARY KEY,`product_name` VARCHAR(80),`product_details` VARCHAR(255));CREATE TABLE `Order_Items` (`order_item_id` INTEGER PRIMARY KEY,`product_id` INTEGER NOT NULL,`order_id` INTEGER NOT NULL,`order_item_status` VARCHAR(10) NOT NULL,`order_item_details` VARCHAR(255),FOREIGN KEY (`order_id` ) REFERENCES `Orders`(`order_id` ),FOREIGN KEY (`product_id` ) REFERENCES `Products`(`product_id` ));CREATE TABLE `Shipments` (`shipment_id` INTEGER PRIMARY KEY,`order_id` INTEGER NOT NULL,`invoice_number` INTEGER NOT NULL,`shipment_tracking_number` VARCHAR(80),`shipment_date` DATETIME,`other_shipment_details` VARCHAR(255),FOREIGN KEY (`order_id` ) REFERENCES `Orders`(`order_id` ),FOREIGN KEY (`invoice_number` ) REFERENCES `Invoices`(`invoice_number` ));CREATE TABLE `Shipment_Items` (`shipment_id` INTEGER NOT NULL,`order_item_id` INTEGER NOT NULL,FOREIGN KEY (`order_item_id` ) REFERENCES `Order_Items`(`order_item_id` ),FOREIGN KEY (`shipment_id` ) REFERENCES `Shipments`(`shipment_id` ))
        ```
        Write the SQL that answers the following question:
        """Find the id of the customer who made the most orders."""
        Respond with only one concise SQL statement.
 SELECT T1.customer_id FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id ORDER BY count(*) DESC LIMIT 1

# Fine Tune Da Vinci - Short Prompt
Follow OpenAI's advice on shortening the prompt used for fine tuning  
In sample accuracy is 91%.

In [185]:
def short_open_ai_prompt(x):
    return f'''Schema: {x['schema']}\nQuestion: {x['question']}\n\n###\n\n'''

In [187]:
df_short_is = pd.read_json('spider/train_spider.json')
df_short_is = df_short_is[['question', 'db_id', 'query']].head(100)

df_short_is['schema']         = df_short_is.apply(lambda x: get_schema(x['db_id']), axis=1)
df_short_is['schema']         = df_short_is['schema'].apply(splitter)
df_short_is['open_ai_prompt'] = df_short_is.apply(lambda x: short_open_ai_prompt(x), axis=1)
df_short_is['open_ai_completion'] = df_short_is.apply(lambda x: open_ai_completion(x), axis=1)

In [ ]:
# data = []
# for idx, row in df_short_is.iterrows():
#     data.append({"prompt": row["open_ai_prompt"], "completion": row["open_ai_completion"]})

# with open("spider_short_prompt_open_ai_fine_tuning.jsonl", "w") as outfile:
#     for obj in data:
#         json.dump(obj, outfile)
#         outfile.write("\n")

In [ ]:
#!openai tools fine_tunes.prepare_data -f spider_short_prompt_open_ai_fine_tuning.jsonl

In [ ]:
#!openai api fine_tunes.create -t "spider_short_prompt_open_ai_fine_tuning.jsonl" -m davinci

## In-Sample Testing

In [54]:
# model davinci:ft-mercator-2023-01-14-01-47-14 is trained on 100 prompts in short format with cleaned schema

# Testing on the last 10 in sample examples was 100% correct
# Testing on the first 90 in sample examples is 90% correct
# df_short_is_testing = df_short_is[['open_ai_prompt','open_ai_completion']].copy().head(90)

df_short_is["model_response"] = ""

def call_model_short(row):
    prompt = row["open_ai_prompt"]
    
    completions = openai.Completion.create(
        engine="davinci:ft-mercator-2023-01-14-01-47-14",
        prompt=prompt,
        max_tokens=1024,
        n=1,
        stop=["\n"],
        temperature=0.5
    )
    
    print(completions.choices[0].text)
    return completions.choices[0].text
    
df_short_is["model_response"] = df_short_is.apply(call_model_short, axis=1)

 SELECT count(*) FROM head WHERE age  >  56
 SELECT name ,  born_state ,  age FROM head ORDER BY age
 SELECT creation ,  name ,  budget_in_billions FROM department
 SELECT max(budget_in_billions) ,  min(budget_in_billions) FROM department
 SELECT avg(num_employees) FROM department WHERE ranking BETWEEN 10 AND 15
 SELECT name FROM head WHERE born_state != 'California'
 SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T3.born_state  =  'Alabama'
 SELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3
 SELECT creation FROM department GROUP BY creation ORDER BY count(*) DESC LIMIT 1
 SELECT T1.name ,  T1.num_employees FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id WHERE T2.temporary_acting  =  'Yes'
 SELECT count(DISTINCT temporary_acting) FROM management
 SELECT count(*) FROM department WHERE department_id NOT IN (SELECT department_id FROM management);
 SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes'
 SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Homeland Security'
 SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1
 SELECT head_id ,  name FROM head WHERE name LIKE '%Ha%'
 SELECT count(*) FROM farm
 SELECT count(*) FROM farm
 SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC
 SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC
 SELECT Hosts FROM farm_competition WHERE Theme !=  'Aliens'
 SELECT Hosts FROM farm_competition WHERE Theme !=  'Aliens'
 SELECT Theme FROM farm_competition ORDER BY YEAR ASC
 SELECT Theme FROM farm_competition ORDER BY YEAR ASC
 SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000
 SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000
 SELECT max(Cows) ,  min(Cows) FROM farm
 SELECT max(Cows) ,  min(Cows) FROM farm
 SELECT count(DISTINCT Status) FROM city
 SELECT count(DISTINCT Status) FROM city
 SELECT Official_Name FROM city ORDER BY Population DESC
 SELECT Official_Name FROM city ORDER BY Population DESC
 SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1
 SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1
 SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID
 SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID
 SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  !=  1
 SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1
 SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000
 SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000
 SELECT Status ,  avg(Population) FROM city GROUP BY Status
 SELECT Status ,  avg(Population) FROM city GROUP BY Status
 SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC
 SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC
 SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1
 SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1
 SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)
 SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)
 SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500
 SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500
 SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500
 SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500
 SELECT Census_Ranking FROM city WHERE Status !=  "Village"
 SELECT Census_Ranking FROM city WHERE Status !=  "Village"
 SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1
 SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1
 SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1
 SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id
 SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id
 SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT student_id FROM student_course_attendance
 SELECT student_id FROM student_course_attendance
 SELECT T1.student_id ,  T2.course_name FROM students AS T1 JOIN courses AS T2 ON T1.student_id = T2.course_id
 SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1
 SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_id = 171
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_id = 171
 SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"
 SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"
 SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1
 SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1
 SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
 SELECT T2.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id
 SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id
 SELECT T1.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.course_id

 SELECT T1.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.course_id
 SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"
 SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"
 SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"
 SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"
 SELECT student_id FROM student_course_registrations WHERE course_id  =  301
 SELECT student_id FROM student_course_attendance WHERE course_id  =  301
 SELECT student_id FROM student_course_attendance WHERE course_id = 301 ORDER BY date_of_attendance DESC LIMIT 1

In [55]:
df_short_is['correct'] = np.where(df_short_is['open_ai_completion'].str
                                                                   .strip()
                                                                   .str
                                                                   .lower()
                                                                   .apply(lambda x: re.sub('\s+', '',x)) == 
                                  df_short_is['model_response'].str
                                                               .strip()
                                                               .str
                                                               .lower()
                                                               .apply(lambda x: re.sub('\s+', '',x)), 1, 0)

df_short_is

,open_ai_prompt,open_ai_completion,model_response,correct
0,"Schema: CREATE TABLE ""department"" (""Department...",SELECT count(*) FROM head WHERE age > 56\n,SELECT count(*) FROM head WHERE age > 56,1
1,"Schema: CREATE TABLE ""department"" (""Department...","SELECT name , born_state , age FROM head OR...","SELECT name , born_state , age FROM head OR...",1
2,"Schema: CREATE TABLE ""department"" (""Department...","SELECT creation , name , budget_in_billions...","SELECT creation , name , budget_in_billions...",1
3,"Schema: CREATE TABLE ""department"" (""Department...","SELECT max(budget_in_billions) , min(budget_...","SELECT max(budget_in_billions) , min(budget_...",1
4,"Schema: CREATE TABLE ""department"" (""Department...",SELECT avg(num_employees) FROM department WHE...,SELECT avg(num_employees) FROM department WHE...,1
...,...,...,...,...
85,Schema: CREATE TABLE Addresses (address_id INT...,SELECT T3.cell_mobile_number FROM candidates ...,SELECT T3.cell_mobile_number FROM candidates ...,1
86,Schema: CREATE TABLE Addresses (address_id INT...,SELECT T3.cell_mobile_number FROM candidates ...,SELECT T3.cell_mobile_number FROM candidates ...,1
87,Schema: CREATE TABLE Addresses (address_id INT...,SELECT student_id FROM student_course_attenda...,SELECT student_id FROM student_course_registr...,0
88,Schema: CREATE TABLE Addresses (address_id INT...,SELECT student_id FROM student_course_attenda...,SELECT student_id FROM student_course_attenda...,1
89,Schema: CREATE TABLE Addresses (address_id INT...,SELECT student_id FROM student_course_attenda...,SELECT student_id FROM student_course_attenda...,1

In [56]:
df_short_is['correct'].mean()

0.9

In [61]:
df_short_is[df_short_is['correct'] == 0]

,open_ai_prompt,open_ai_completion,model_response,correct
36,"Schema: CREATE TABLE ""city"" (""City_ID"" int,""Of...",SELECT T1.Official_Name FROM city AS T1 JOIN ...,SELECT T1.Official_Name FROM city AS T1 JOIN ...,0
66,Schema: CREATE TABLE Addresses (address_id INT...,"SELECT T1.student_id , T2.course_name FROM s...","SELECT T1.student_id , T2.course_name FROM s...",0
71,Schema: CREATE TABLE Addresses (address_id INT...,SELECT count(*) FROM courses AS T1 JOIN stude...,SELECT count(*) FROM courses AS T1 JOIN stude...,0
72,Schema: CREATE TABLE Addresses (address_id INT...,SELECT count(*) FROM courses AS T1 JOIN stude...,SELECT count(*) FROM courses AS T1 JOIN stude...,0
77,Schema: CREATE TABLE Addresses (address_id INT...,SELECT T1.student_details FROM students AS T1...,SELECT T2.student_details FROM student_course...,0
78,Schema: CREATE TABLE Addresses (address_id INT...,SELECT T1.student_details FROM students AS T1...,SELECT T2.student_details FROM students AS T1...,0
81,Schema: CREATE TABLE Addresses (address_id INT...,"SELECT T3.course_name , count(*) FROM studen...","SELECT T1.course_name , count(*) FROM studen...",0
82,Schema: CREATE TABLE Addresses (address_id INT...,"SELECT T3.course_name , count(*) FROM studen...","SELECT T1.course_name , count(*) FROM studen...",0
87,Schema: CREATE TABLE Addresses (address_id INT...,SELECT student_id FROM student_course_attenda...,SELECT student_id FROM student_course_registr...,0

In [78]:
# Of the 9 that are wrong:
# No. 36 is close and possibly right but not exactly the same, depending on the data
# No. 66 is wrong
# No. 71 is wrong
# No. 72 is wrong
# No. 77 is written differently but is functionally identical (relabeled tables)
# No. 78 is wrong
# No. 81 is close and possibly right, depending on the data
# No. 82 is close and possibly right, depending on the data
# No. 87 is wrong
i = 87
print(df_short_is.iloc[i]['open_ai_prompt'])
print(df_short_is.iloc[i]['open_ai_completion'])
print(df_short_is.iloc[i]['model_response'])

Schema: CREATE TABLE Addresses (address_id INTEGER NOT NULL,line_1 VARCHAR(80),line_2 VARCHAR(80),city VARCHAR(50),zip_postcode CHAR(20),state_province_county VARCHAR(50),country VARCHAR(50),PRIMARY KEY (address_id));CREATE TABLE People (person_id INTEGER NOT NULL,first_name VARCHAR(255),middle_name VARCHAR(255),last_name VARCHAR(255),cell_mobile_number VARCHAR(40),email_address VARCHAR(40),login_name VARCHAR(40),password VARCHAR(40),PRIMARY KEY (person_id));CREATE TABLE Students (student_id INTEGER NOT NULL,student_details VARCHAR(255),PRIMARY KEY (student_id),FOREIGN KEY (student_id) REFERENCES People (person_id));CREATE TABLE Courses (course_id VARCHAR(100) NOT NULL,course_name VARCHAR(120),course_description VARCHAR(255),other_details VARCHAR(255),PRIMARY KEY (course_id));CREATE TABLE People_Addresses (person_address_id INTEGER NOT NULL,person_id INTEGER NOT NULL,address_id INTEGER NOT NULL,date_from DATETIME,date_to DATETIME,PRIMARY KEY (person_address_id),FOREIGN KEY (person_id) REFERENCES People (person_id),FOREIGN KEY (address_id) REFERENCES Addresses (address_id));CREATE TABLE Student_Course_Registrations (student_id INTEGER NOT NULL,course_id INTEGER NOT NULL,registration_date DATETIME NOT NULL,PRIMARY KEY (student_id, course_id),FOREIGN KEY (student_id) REFERENCES Students (student_id),FOREIGN KEY (course_id) REFERENCES Courses (course_id));CREATE TABLE Student_Course_Attendance (student_id INTEGER NOT NULL,course_id INTEGER NOT NULL,date_of_attendance DATETIME NOT NULL,PRIMARY KEY (student_id, course_id),FOREIGN KEY (student_id, course_id) REFERENCES Student_Course_Registrations (student_id,course_id));CREATE TABLE Candidates (candidate_id INTEGER NOT NULL ,candidate_details VARCHAR(255),PRIMARY KEY (candidate_id),FOREIGN KEY (candidate_id) REFERENCES People (person_id));CREATE TABLE Candidate_Assessments (candidate_id INTEGER NOT NULL,qualification CHAR(15) NOT NULL,assessment_date DATETIME NOT NULL,asessment_outcome_code CHAR(15) NOT NULL,PRIMARY KEY (candidate_id, qualification),FOREIGN KEY (candidate_id) REFERENCES Candidates (candidate_id))
Question: What are the id of students who registered course 301?

###


 SELECT student_id FROM student_course_attendance WHERE course_id  =  301

 SELECT student_id FROM student_course_registrations WHERE course_id  =  301

## Out-of-sample testing

In [190]:
df_short_oos = pd.read_json('spider/train_spider.json')
df_short_oos = df_short_oos[['question', 'db_id', 'query']].tail(100)

df_short_oos['schema']         = df_short_oos.apply(lambda x: get_schema(x['db_id']), axis=1)
df_short_oos['schema']         = df_short_oos['schema'].apply(splitter)
df_short_oos['open_ai_prompt'] = df_short_oos.apply(lambda x: short_open_ai_prompt(x), axis=1)
df_short_oos['open_ai_completion'] = df_short_oos.apply(lambda x: open_ai_completion(x), axis=1)

df_short_oos["model_response"] = ""    
df_short_oos["model_response"] = df_short_oos.apply(call_model_short, axis=1)

 SELECT customer_id FROM customers GROUP BY customer_id ORDER BY count(*) DESC LIMIT 1
 SELECT order_id , order_item_status FROM orders WHERE customer_name = 'Jeramie'
 SELECT order_id , order_status FROM orders WHERE customer_name = 'Jeramie'
 SELECT order_date FROM orders WHERE customer_name = "Jeramie"
 SELECT order_date FROM orders WHERE customer_name = 'Jeramie'
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.date_order_placed  BETWEEN  '2009-01-01'  AND  '2010-01-01'
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id WHERE T1.customer_id  BETWEEN  2009 AND  2010
 SELECT DISTINCT PRODUCT_ID FROM ORDERS WHERE ORDER_DATE BETWEEN  1975-01-01 AND  1976-01-01
 SELECT DISTINCT T1.product_id FROM orders AS T1 JOIN order_items AS T2 ON T1.order_id  =  T2.order_id WHERE T1.date_order_placed  BETWEEN  1975-01-01  AND  1976-01-01
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id WHERE T1.order_status  =  'On Road' INTERSECT JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id WHERE T1.order_status  =  'Shipped'
 SELECT T1.customer_name FROM orders AS T1 JOIN order_items AS T2 ON T1.order_id  =  T2.order_id WHERE T1.order_status  =  'On Road' INTERSECT SELECT T1.customer_name FROM orders AS T1 JOIN order_items AS T2 ON T1.order_id  =  T2.order_id WHERE T1.order_status  =  'Shipped'
 SELECT T1.customer_id FROM orders AS T1 JOIN order_items AS T2 ON T1.customer_id  =  T2.customer_id WHERE T1.order_status  =  "On Road" INTERSECT SELECT T1.customer_id FROM orders AS T1 JOIN order_items AS T2 ON T1.customer_id  =  T2.customer_id WHERE T1.order_status  =  "Shipped"
 SELECT T1.customer_id FROM orders AS T1 JOIN order_items AS T2 ON T1.order_id  =  T2.order_id WHERE T1.order_status  =  'On Road' INTERSECT JOIN shipments AS T3 ON T1.order_id  =  T3.order_id WHERE T1.order_status  =  'Shipped'
 SELECT date_order_placed FROM orders WHERE order_tracking_number  =  3452
 SELECT order_date FROM orders WHERE order_tracking_number  =  3452
 SELECT T1.date_order_placed FROM orders AS T1 JOIN order_items AS T2 ON T1.order_id  =  T2.order_id WHERE T1.invoice_number  =  10
 SELECT T2.date_order_placed FROM orders AS T1 JOIN invoices AS T2 ON T1.order_id  =  T2.invoice_id WHERE T1.order_number  =  '10'
 SELECT count(*) ,  product_id FROM products GROUP BY product_id
 SELECT product_id ,  count(*) FROM orders GROUP BY product_id
 SELECT product_name , count(*) FROM products GROUP BY product_name
 SELECT product_name ,  count(*) FROM orders GROUP BY product_name
 SELECT order_id FROM orders WHERE order_date AFTER "2000-01-01"
 SELECT order_id FROM orders WHERE shipment_date > '2000-01-01'
 SELECT order_id FROM orders ORDER BY order_date DESC LIMIT 1
 SELECT order_id FROM orders ORDER BY order_date DESC LIMIT 1
 SELECT DISTINCT T1.product_name FROM products AS T1 ORDER BY product_name
 SELECT DISTINCT product_name FROM products ORDER BY product_name
 SELECT order_id FROM orders ORDER BY date_order_placed
 SELECT order_id FROM orders ORDER BY date_order_placed
 SELECT order_id FROM orders GROUP BY order_id ORDER BY count(*) DESC LIMIT 1
 SELECT order_id FROM orders GROUP BY order_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id ORDER BY count(*) DESC LIMIT 1
 SELECT T2.invoice_number FROM invoices AS T1 JOIN invoices AS T2 ON T1.invoice_number  BEFORE 1989-09-03 OR T1.invoice_number  AFTER 2007-12-25
 SELECT T1.invoice_number FROM invoices AS T1 JOIN orders AS T2 ON T1.invoice_number  =  T2.invoice_number WHERE T1.invoice_date  <  '1989-09-03' OR T1.invoice_date  >  '2007-12-25'
 SELECT DISTINCT T1.invoice_details FROM invoices AS T1 JOIN orders AS T2 ON T1.invoice_number  =  T2.invoice_number WHERE T1.invoice_date  <  1989-09-03 OR T1.invoice_date  >  2007-12-25
 SELECT DISTINCT T1.invoice_details FROM invoices AS T1 JOIN orders AS T2 ON T1.invoice_number  =  T2.invoice_number JOIN shipment_items AS T3 ON T2.order_id  =  T3.order_id WHERE T1.invoice_date  NOT  LIKE  "%1989-09-03%" OR T1.invoice_date  NOT  LIKE  "%2007-12-25%"
 SELECT T1.customer_name ,  count(*) FROM orders AS T1 JOIN customers AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id HAVING count(*)  >=  2
 SELECT T1.customer_name ,  count(*) FROM orders AS O JOIN customers AS T1 ON O.customer_id  =  T1.customer_id GROUP BY T1.customer_id HAVING count(*)  >=  2
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id HAVING COUNT(*)  <=  2
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id HAVING COUNT(*)  <=  2
 SELECT T1.customer_name FROM customers AS T1 JOIN products AS T2 ON T1.customer_id  =  T2.product_id WHERE T2.product_name  =  "food"
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.product_name  =  'food'
 SELECT T1.customer_name FROM customers AS T1 JOIN order_items AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.product_name  =  "food" AND T2.item_status  =  "Cancel"
 SELECT T1.customer_name FROM customers AS T1 JOIN order_items AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.product_id  =  'food' AND T2.item_status  =  'Cancel'
 SELECT count(DISTINCT gender) FROM architect
 SELECT T1.name ,  T1.nationality ,  T1.id FROM architect AS T1 ORDER BY T1.name ASC LIMIT 1
 SELECT max(length_meters) ,  architects.name FROM bridge JOIN architect ON bridge.architect_id  =  architect.id GROUP BY bridge.id
 SELECT avg(length_feet) FROM bridge
 SELECT T1.name ,  T1.built_year FROM mill AS T1 JOIN mill AS T2 ON T1.type = T2.type WHERE T1.type = 'Grondzeiler'
 SELECT DISTINCT T1.name ,  T1.nationality FROM architect AS T1 JOIN mill AS T2 ON T1.id  =  T2.architect_id GROUP BY T1.id
 SELECT T1.name FROM mill AS T1 JOIN architect AS T2 ON T1.architect_id  =  T2.id WHERE T1.location  !=  'Donceel'
 SELECT DISTINCT T1.type FROM mill AS T1 JOIN architect AS T2 ON T1.architect_id  =  T2.id WHERE T1.type  =  'mill' GROUP BY T1.type HAVING T1.type  =  'mill' OR T1.type  =  '-mill'
 SELECT T1.id ,  T1.name FROM architect AS T1 JOIN bridge AS T2 ON T1.id  =  T2.architect_id GROUP BY T1.id HAVING count(*)  >=  3
 SELECT T1.id ,  T1.name ,  T1.nationality FROM architect AS T1 JOIN mill AS T2 ON T1.id  =  T2.architect_id GROUP BY T1.id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.id ,  T1.name ,  T1.gender FROM architect AS T1 JOIN bridge AS T2 ON T1.id  =  T2.architect_id JOIN mill AS T3 ON T1.id  =  T3.architect_id
 SELECT T1.location FROM bridge AS T1 JOIN mill AS T2 ON T1.id  =  T2.id WHERE T1.name  =  'Kolob Arch' OR T1.name  =  'Rainbow Bridge'
 SELECT T1.name FROM mill AS T1 JOIN architect AS T2 ON T1.architect_id  =  T2.id WHERE T1.name  LIKE  '%Moulin%'
 SELECT DISTINCT T1.name FROM mill AS T1 JOIN bridge AS T2 ON T1.id  =  T2.architect_id WHERE T2.length_meters  >  80
 SELECT count(*) ,  type FROM mill GROUP BY type
 SELECT count(*) FROM architect WHERE  built_year  !=  '1850'
 SELECT name FROM bridge ORDER BY length_feet DESC
 SELECT count(*) FROM book_club
 SELECT count(*) FROM book_club
 SELECT Book_Title ,  Author_or_Editor FROM book_club WHERE Year  >  1989
 SELECT T2.Book_Title ,  T1.Author_or_Editor FROM book_club AS T1 JOIN book_club AS T2 ON T1.book_club_id  =  T2.book_club_id WHERE T1.Year  >  1989
 SELECT DISTINCT T1.Publisher FROM book_club AS T1 JOIN book_club AS T2 ON T1.book_club_id  =  T2.book_club_id JOIN publisher AS T3 ON T2.publisher_id  =  T3.publisher_id
 SELECT DISTINCT T1.Publisher FROM book_club AS T1 JOIN culture_company AS T2 ON T1.book_club_id  =  T2.book_club_id
 SELECT Year ,  Book_Title ,  Publisher FROM book_club ORDER BY Year DESC
 SELECT year ,  title ,  publisher FROM book_club ORDER BY year DESC
 SELECT T1.publisher ,  count(*) FROM book_club AS T1 JOIN publisher AS T2 ON T1.publisher_or_editor_text  =  T2.publisher_or_editor_text GROUP BY T1.publisher_or_editor_text

 SELECT count(*) FROM book_club GROUP BY publisher
 SELECT T1.publisher FROM book_club AS T1 JOIN book_club AS T2 ON T1.book_club_id  =  T2.book_club_id GROUP BY T1.publisher ORDER BY count(*) DESC LIMIT 1
 SELECT T1.publisher FROM book_club AS T1 JOIN book_club AS T2 ON T1.book_club_id  =  T2.book_club_id GROUP BY T1.publisher ORDER BY count(*) DESC LIMIT 1
 SELECT category ,  count(*) FROM book_club GROUP BY category
 SELECT count(DISTINCT Category) FROM book_club
 SELECT Category FROM book_club WHERE Year  >=  1989 GROUP BY Category HAVING COUNT(*)  >=  2
 SELECT T1.Category FROM book_club AS T1 JOIN book_club AS T2 ON T1.book_club_id  =  T2.book_club_id WHERE T2.Year  >  1989
 SELECT T1.Publisher FROM book_club AS T1 JOIN book_club AS T2 ON T1.book_club_id  =  T2.book_club_id WHERE T1.Year  =  1989 INTERSECT SELECT T1.Publisher FROM book_club AS T1 JOIN book_club AS T2 ON T1.book_club_id  =  T2.book_club_id WHERE T1.Year  =  1990
 SELECT Publisher FROM book_club WHERE Book_Title LIKE '%1989%' OR Book_Title LIKE '%1990%'
 SELECT Publisher FROM book_club WHERE YEAR != 1989
 SELECT publisher FROM book_club WHERE year != 1989
 SELECT T1.Title ,  T1.Year ,  T1.Director FROM movie AS T1 ORDER BY T1.Budget_million
 SELECT T1.Title ,  T1.Year ,  T1.Director FROM movie AS T1 ORDER BY T1.Budget_million DESC
 SELECT count(*) FROM movie
 SELECT count(DISTINCT director) FROM movie
 SELECT T1.Title ,  T1.Director FROM movie AS T1 JOIN culture_company AS T2 ON T1.movie_id  =  T2.movie_id WHERE T1.year  =  '2000' OR T1.year  =  'before'
 SELECT Title , Director FROM movie WHERE YEAR  =  2000  OR YEAR  =  EARLIER  ORDER BY Gross_worldwide DESC LIMIT 1
 SELECT T2.director FROM movie AS T1 JOIN movie AS T2 ON T1.movie_id  =  T2.movie_id WHERE T1.year  =  '1999' INTERSECT JOIN movie AS T2 ON T1.movie_id  =  T2.movie_id WHERE T1.year  =  '2000'
 SELECT T1.director FROM movie AS T1 JOIN movie AS T2 ON T1.movie_id  =  T2.movie_id WHERE T1.year  =  '1999' INTERSECT SELECT T1.director FROM movie AS T1 JOIN movie AS T2 ON T1.movie_id  =  T2.movie_id WHERE T1.year  =  '2000'
 SELECT DISTINCT T1.director FROM movie AS T1 JOIN culture_company AS T2 ON T1.director_id  =  T2.director_id WHERE T1.year  IN  ('1999', '2000')
 SELECT DISTINCT T2.Director FROM movie AS T1 JOIN movie AS T2 ON T1.movie_id  =  T2.movie_id WHERE T1.year  IN  ('1999', '2000')
 SELECT avg(budget_million),  max(budget_million),  min(budget_million) FROM movie WHERE year <=  2000
 SELECT avg(Budget_million),  max(Budget_million),  min(Budget_million) FROM movie WHERE Year  <  2000
 SELECT T1.Company_name FROM book_club AS T1 JOIN publisher AS T2 ON T1.publisher_id  =  T2.publisher_id JOIN book_publishing AS T3 ON T1.book_publishing_id  =  T3.book_publishing_id WHERE T3.publisher_id  =  'Alyson'
 SELECT T1.Company_name FROM book_club AS T1 JOIN publisher AS T2 ON T1.publisher_id  =  T2.publisher_id JOIN book_pub AS T3 ON T1.book_pub_id  =  T3.book_pub_id WHERE T2.name  =  'Alyson'
 SELECT T1.Title ,  T2.Title FROM movie AS T1 JOIN book_club AS T2 ON T1.movie_id  =  T2.book_club_id WHERE T2.country  =  'China'
 SELECT T1.Title FROM movie AS T1 JOIN book_club AS T2 ON T1.movie_id  =  T2.book_club_id WHERE T2.Incorporated_in  =  'China'
 SELECT T1.Company_name FROM Company AS T1 JOIN movie AS T2 ON T1.company_name  =  T2.director_or_producer_name WHERE T2.year  =  '1999'
 SELECT T1.Company_name FROM company AS T1 JOIN movie AS T2 ON T1.company_name  =  T2.director_name WHERE T2.year  =  '1999'

In [191]:
df_short_oos['correct'] = np.where(df_short_oos['open_ai_completion'].str
                                                                     .strip()
                                                                     .str
                                                                     .lower()
                                                                     .apply(lambda x: re.sub('\s+', '',x)) == 
                                   df_short_oos['model_response'].str
                                                                 .strip()
                                                                 .str
                                                                 .lower()
                                                                 .apply(lambda x: re.sub('\s+', '',x)), 1, 0)

df_short_oos

,question,db_id,query,schema,open_ai_prompt,open_ai_completion,model_response,correct
6900,Find the id of the customer who made the most ...,tracking_orders,SELECT T1.customer_id FROM customers AS T1 JOI...,CREATE TABLE `Customers` (`customer_id` INTEGE...,Schema: CREATE TABLE `Customers` (`customer_id...,SELECT T1.customer_id FROM customers AS T1 JO...,SELECT customer_id FROM customers GROUP BY cu...,0
6901,Give me a list of id and status of orders whic...,tracking_orders,"SELECT T2.order_id , T2.order_status FROM cus...",CREATE TABLE `Customers` (`customer_id` INTEGE...,Schema: CREATE TABLE `Customers` (`customer_id...,"SELECT T2.order_id , T2.order_status FROM cu...","SELECT order_id , order_item_status FROM orde...",0
6902,"Which orders are made by the customer named ""J...",tracking_orders,"SELECT T2.order_id , T2.order_status FROM cus...",CREATE TABLE `Customers` (`customer_id` INTEGE...,Schema: CREATE TABLE `Customers` (`customer_id...,"SELECT T2.order_id , T2.order_status FROM cu...","SELECT order_id , order_status FROM orders WH...",0
6903,Find the dates of orders which belong to the c...,tracking_orders,SELECT T2.date_order_placed FROM customers AS ...,CREATE TABLE `Customers` (`customer_id` INTEGE...,Schema: CREATE TABLE `Customers` (`customer_id...,SELECT T2.date_order_placed FROM customers AS...,SELECT order_date FROM orders WHERE customer_...,0
6904,What are the dates of the orders made by the c...,tracking_orders,SELECT T2.date_order_placed FROM customers AS ...,CREATE TABLE `Customers` (`customer_id` INTEGE...,Schema: CREATE TABLE `Customers` (`customer_id...,SELECT T2.date_order_placed FROM customers AS...,SELECT order_date FROM orders WHERE customer_...,0
...,...,...,...,...,...,...,...,...
6995,What are all the company names that have a boo...,culture_company,SELECT T1.company_name FROM culture_company AS...,"CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...",SELECT T1.company_name FROM culture_company A...,SELECT T1.Company_name FROM book_club AS T1 J...,0
6996,Show the movie titles and book titles for all ...,culture_company,"SELECT T1.title , T3.book_title FROM movie AS...","CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...","SELECT T1.title , T3.book_title FROM movie A...","SELECT T1.Title , T2.Title FROM movie AS T1 ...",0
6997,What are the titles of movies and books corres...,culture_company,"SELECT T1.title , T3.book_title FROM movie AS...","CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...","SELECT T1.title , T3.book_title FROM movie A...",SELECT T1.Title FROM movie AS T1 JOIN book_cl...,0
6998,Show all company names with a movie directed i...,culture_company,SELECT T2.company_name FROM movie AS T1 JOIN c...,"CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...",SELECT T2.company_name FROM movie AS T1 JOIN ...,SELECT T1.Company_name FROM Company AS T1 JOI...,0
6999,What are all company names that have a corresp...,culture_company,SELECT T2.company_name FROM movie AS T1 JOIN c...,"CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...",SELECT T2.company_name FROM movie AS T1 JOIN ...,SELECT T1.Company_name FROM company AS T1 JOI...,0

In [192]:
df_short_oos['correct'].mean()

0.12

In [193]:
df_short_oos[df_short_oos['correct'] == 1]

,question,db_id,query,schema,open_ai_prompt,open_ai_completion,model_response,correct
6926,Sort all the distinct products in alphabetical...,tracking_orders,SELECT DISTINCT product_name FROM products ORD...,CREATE TABLE `Customers` (`customer_id` INTEGE...,Schema: CREATE TABLE `Customers` (`customer_id...,SELECT DISTINCT product_name FROM products OR...,SELECT DISTINCT product_name FROM products OR...,1
6932,Find the name of the customer who made the mos...,tracking_orders,SELECT T1.customer_name FROM customers AS T1 J...,CREATE TABLE `Customers` (`customer_id` INTEGE...,Schema: CREATE TABLE `Customers` (`customer_id...,SELECT T1.customer_name FROM customers AS T1 ...,SELECT T1.customer_name FROM customers AS T1 ...,1
6948,What is the average length in feet of the brid...,architecture,SELECT avg(length_feet) FROM bridge,"CREATE TABLE ""architect"" (""id"" text,""name"" tex...","Schema: CREATE TABLE ""architect"" (""id"" text,""n...",SELECT avg(length_feet) FROM bridge\n,SELECT avg(length_feet) FROM bridge,1
6953,What are the ids and names of the architects w...,architecture,"SELECT T1.id , T1.name FROM architect AS T1 J...","CREATE TABLE ""architect"" (""id"" text,""name"" tex...","Schema: CREATE TABLE ""architect"" (""id"" text,""n...","SELECT T1.id , T1.name FROM architect AS T1 ...","SELECT T1.id , T1.name FROM architect AS T1 ...",1
6954,"What is the id, name and nationality of the ar...",architecture,"SELECT T1.id , T1.name , T1.nationality FROM...","CREATE TABLE ""architect"" (""id"" text,""name"" tex...","Schema: CREATE TABLE ""architect"" (""id"" text,""n...","SELECT T1.id , T1.name , T1.nationality FRO...","SELECT T1.id , T1.name , T1.nationality FRO...",1
6962,How many book clubs are there?,culture_company,SELECT count(*) FROM book_club,"CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...",SELECT count(*) FROM book_club\n,SELECT count(*) FROM book_club,1
6963,Count the number of book clubs.,culture_company,SELECT count(*) FROM book_club,"CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...",SELECT count(*) FROM book_club\n,SELECT count(*) FROM book_club,1
6964,"show the titles, and authors or editors for al...",culture_company,"SELECT book_title , author_or_editor FROM boo...","CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...","SELECT book_title , author_or_editor FROM bo...","SELECT Book_Title , Author_or_Editor FROM bo...",1
6968,"Show the years, book titles, and publishers fo...",culture_company,"SELECT YEAR , book_title , publisher FROM bo...","CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...","SELECT YEAR , book_title , publisher FROM b...","SELECT Year , Book_Title , Publisher FROM b...",1
6974,Show all book categories and the number of boo...,culture_company,"SELECT category , count(*) FROM book_club GRO...","CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...","SELECT category , count(*) FROM book_club GR...","SELECT category , count(*) FROM book_club GR...",1
6985,Count the number of different directors.,culture_company,SELECT COUNT (DISTINCT director) FROM movie,"CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...",SELECT COUNT (DISTINCT director) FROM movie\n,SELECT count(DISTINCT director) FROM movie,1
6993,"Return the average, maximum, and minimum budge...",culture_company,"SELECT avg(budget_million) , max(budget_milli...","CREATE TABLE ""book_club"" (""book_club_id"" int,""...","Schema: CREATE TABLE ""book_club"" (""book_club_i...","SELECT avg(budget_million) , max(budget_mill...","SELECT avg(Budget_million), max(Budget_milli...",1

In [194]:
# 6990 has a pointless self-join but gives correct answer
# 6991 is the same as 6990
# 6994 is wrong and hallucinates a column
# 6995 is wrong and hallucinates a table
# 6996 is wrong
# 6997 answers half the question, replaces single quotes with double quotes
# 6998 is wrong

i = 6998
print(df_short_oos.loc[i]['open_ai_prompt'])
print(df_short_oos.loc[i]['open_ai_completion'])
print(df_short_oos.loc[i]['model_response'])

Schema: CREATE TABLE "book_club" ("book_club_id" int,"Year" int,"Author_or_Editor" text,"Book_Title" text,"Publisher" text,"Category" text,"Result" text,PRIMARY KEY ("book_club_id"));CREATE TABLE "movie" ("movie_id" int,"Title" text,"Year" int,"Director" text,"Budget_million" real,"Gross_worldwide" int,PRIMARY KEY("movie_id"));CREATE TABLE "culture_company" ("Company_name" text,"Type" text,"Incorporated_in" text,"Group_Equity_Shareholding" real,"book_club_id" text,"movie_id" text,PRIMARY KEY("Company_name"),FOREIGN KEY ("book_club_id") REFERENCES "book_club"("book_club_id"),FOREIGN KEY ("movie_id") REFERENCES "movie"("movie_id"))
Question: Show all company names with a movie directed in year 1999.

###


 SELECT T2.company_name FROM movie AS T1 JOIN culture_company AS T2 ON T1.movie_id  =  T2.movie_id WHERE T1.year  =  1999

 SELECT T1.Company_name FROM Company AS T1 JOIN movie AS T2 ON T1.company_name  =  T2.director_or_producer_name WHERE T2.year  =  '1999'

# Redo train-test split
Before, I took the first 100 samples as the training set and the last 100 as the test set. The samples aren't ordered randomly, though.  

Make sure to randomize at the level of schemas. Don't want to show it the schema in training and test on the same one.  
98% correct in sample  
16% correct out of sample

In [234]:
df2 = pd.read_json('spider/train_spider.json')
df_db_id = pd.DataFrame(df2['db_id'].unique(), columns=['db_id'])
df_db_id['train_test'] = np.random.choice(['train','test'], df_db_id.shape[0])
df2 = df2.merge(df_db_id, on='db_id')
df2.head(10)

,db_id,query,query_toks,query_toks_no_value,question,question_toks,sql,train_test
0,department_management,SELECT count(*) FROM head WHERE age > 56,"[SELECT, count, (, *, ), FROM, head, WHERE, ag...","[select, count, (, *, ), from, head, where, ag...",How many heads of the departments are older th...,"[How, many, heads, of, the, departments, are, ...","{'from': {'table_units': [['table_unit', 1]], ...",test
1,department_management,"SELECT name , born_state , age FROM head ORD...","[SELECT, name, ,, born_state, ,, age, FROM, he...","[select, name, ,, born_state, ,, age, from, he...","List the name, born state and age of the heads...","[List, the, name, ,, born, state, and, age, of...","{'from': {'table_units': [['table_unit', 1]], ...",test
2,department_management,"SELECT creation , name , budget_in_billions ...","[SELECT, creation, ,, name, ,, budget_in_billi...","[select, creation, ,, name, ,, budget_in_billi...","List the creation year, name and budget of eac...","[List, the, creation, year, ,, name, and, budg...","{'from': {'table_units': [['table_unit', 0]], ...",test
3,department_management,"SELECT max(budget_in_billions) , min(budget_i...","[SELECT, max, (, budget_in_billions, ), ,, min...","[select, max, (, budget_in_billions, ), ,, min...",What are the maximum and minimum budget of the...,"[What, are, the, maximum, and, minimum, budget...","{'from': {'table_units': [['table_unit', 0]], ...",test
4,department_management,SELECT avg(num_employees) FROM department WHER...,"[SELECT, avg, (, num_employees, ), FROM, depar...","[select, avg, (, num_employees, ), from, depar...",What is the average number of employees of the...,"[What, is, the, average, number, of, employees...","{'from': {'table_units': [['table_unit', 0]], ...",test
5,department_management,SELECT name FROM head WHERE born_state != 'Cal...,"[SELECT, name, FROM, head, WHERE, born_state, ...","[select, name, from, head, where, born_state, ...",What are the names of the heads who are born o...,"[What, are, the, names, of, the, heads, who, a...","{'from': {'table_units': [['table_unit', 1]], ...",test
6,department_management,SELECT DISTINCT T1.creation FROM department AS...,"[SELECT, DISTINCT, T1.creation, FROM, departme...","[select, distinct, t1, ., creation, from, depa...",What are the distinct creation years of the de...,"[What, are, the, distinct, creation, years, of...","{'from': {'table_units': [['table_unit', 0], [...",test
7,department_management,SELECT born_state FROM head GROUP BY born_stat...,"[SELECT, born_state, FROM, head, GROUP, BY, bo...","[select, born_state, from, head, group, by, bo...",What are the names of the states where at leas...,"[What, are, the, names, of, the, states, where...","{'from': {'table_units': [['table_unit', 1]], ...",test
8,department_management,SELECT creation FROM department GROUP BY creat...,"[SELECT, creation, FROM, department, GROUP, BY...","[select, creation, from, department, group, by...",In which year were most departments established?,"[In, which, year, were, most, departments, est...","{'from': {'table_units': [['table_unit', 0]], ...",test
9,department_management,"SELECT T1.name , T1.num_employees FROM depart...","[SELECT, T1.name, ,, T1.num_employees, FROM, d...","[select, t1, ., name, ,, t1, ., num_employees,...",Show the name and number of employees for the ...,"[Show, the, name, and, number, of, employees, ...","{'from': {'table_units': [['table_unit', 0], [...",test

In [275]:
df2_is = df2[df2['train_test'] == 'train'][['question', 'db_id', 'query']].head(100)

df2_is['schema']         = df2_is.apply(lambda x: get_schema(x['db_id']), axis=1)
df2_is['schema']         = df2_is['schema'].apply(splitter)
df2_is['open_ai_prompt'] = df2_is.apply(lambda x: short_open_ai_prompt(x), axis=1)
df2_is['open_ai_completion'] = df2_is.apply(lambda x: open_ai_completion(x), axis=1)

In [242]:
df2_is

,question,db_id,query,schema,open_ai_prompt,open_ai_completion
56,which course has most number of registered stu...,student_assessment,SELECT T1.course_name FROM courses AS T1 JOIN ...,CREATE TABLE Addresses (address_id INTEGER NOT...,Schema: CREATE TABLE Addresses (address_id INT...,SELECT T1.course_name FROM courses AS T1 JOIN...
57,What is the name of the course with the most r...,student_assessment,SELECT T1.course_name FROM courses AS T1 JOIN ...,CREATE TABLE Addresses (address_id INTEGER NOT...,Schema: CREATE TABLE Addresses (address_id INT...,SELECT T1.course_name FROM courses AS T1 JOIN...
58,what is id of students who registered some cou...,student_assessment,SELECT student_id FROM student_course_registra...,CREATE TABLE Addresses (address_id INTEGER NOT...,Schema: CREATE TABLE Addresses (address_id INT...,SELECT student_id FROM student_course_registr...
59,What are the ids of the students who registere...,student_assessment,SELECT student_id FROM student_course_registra...,CREATE TABLE Addresses (address_id INTEGER NOT...,Schema: CREATE TABLE Addresses (address_id INT...,SELECT student_id FROM student_course_registr...
60,what are the first name and last name of all c...,student_assessment,"SELECT T2.first_name , T2.last_name FROM cand...",CREATE TABLE Addresses (address_id INTEGER NOT...,Schema: CREATE TABLE Addresses (address_id INT...,"SELECT T2.first_name , T2.last_name FROM can..."
...,...,...,...,...,...,...
151,What is the average longitude of stations that...,bike_1,SELECT avg(long) FROM station WHERE id NOT IN ...,CREATE TABLE station ( id INTEGER PRIMARY K...,Schema: CREATE TABLE station ( id INTEGER P...,SELECT avg(long) FROM station WHERE id NOT IN...
152,What is the mean longitude for all stations th...,bike_1,SELECT avg(long) FROM station WHERE id NOT IN ...,CREATE TABLE station ( id INTEGER PRIMARY K...,Schema: CREATE TABLE station ( id INTEGER P...,SELECT avg(long) FROM station WHERE id NOT IN...
153,When and in what zip code did max temperature ...,bike_1,"SELECT date , zip_code FROM weather WHERE max...",CREATE TABLE station ( id INTEGER PRIMARY K...,Schema: CREATE TABLE station ( id INTEGER P...,"SELECT date , zip_code FROM weather WHERE ma..."
154,What zip codes have a station with a max tempe...,bike_1,"SELECT date , zip_code FROM weather WHERE max...",CREATE TABLE station ( id INTEGER PRIMARY K...,Schema: CREATE TABLE station ( id INTEGER P...,"SELECT date , zip_code FROM weather WHERE ma..."
155,Give me ids for all the trip that took place i...,bike_1,SELECT T1.id FROM trip AS T1 JOIN weather AS T...,CREATE TABLE station ( id INTEGER PRIMARY K...,Schema: CREATE TABLE station ( id INTEGER P...,SELECT T1.id FROM trip AS T1 JOIN weather AS ...

## Train

In [249]:
# Put the training data into jsonl format
data = []
for idx, row in df2_is.iterrows():
    data.append({"prompt": row["open_ai_prompt"], "completion": row["open_ai_completion"]})

timestr = time.strftime("%Y%m%d-%H%M%S")
with open("spider_open_ai_fine_tuning_" + timestr + ".jsonl", "w") as outfile:
    for obj in data:
        json.dump(obj, outfile)
        outfile.write("\n")

In [ ]:
#!openai tools fine_tunes.prepare_data -f spider_open_ai_fine_tuning_20230117-153523.jsonl

In [ ]:
#!openai api fine_tunes.create -t spider_open_ai_fine_tuning_20230117-153523.jsonl -m davinci

In [257]:
#!openai api fine_tunes.list

In [255]:
def call_model_2(row):
    prompt = row["open_ai_prompt"]
    
    completions = openai.Completion.create(
        engine="davinci:ft-mercator-2023-01-18-00-37-55",
        prompt=prompt,
        max_tokens=1024,
        n=1,
        stop=["\n"],
        temperature=0.5
    )
    
    print(completions.choices[0].text)
    return completions.choices[0].text

## Test in sample

In [256]:
df2_is["model_response"] = ""    
df2_is["model_response"] = df2_is.apply(call_model_2, axis=1)

 SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1
 SELECT course_name FROM student_course_registrations GROUP BY course_id ORDER BY count(*) DESC LIMIT 1
 SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1
 SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1
 SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id
 SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id
 SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT student_id FROM student_course_attendance
 SELECT student_id FROM student_course_attendance
 SELECT T1.student_id ,  T2.course_name FROM student_course_registrations AS T1 JOIN courses AS T2 ON T1.course_id = T2.course_id
 SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1
 SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171
 SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"
 SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"
 SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1
 SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1
 SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id
 SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id
 SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id
 SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id
 SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"
 SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"
 SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"
 SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"
 SELECT student_id FROM student_course_attendance WHERE course_id  =  301
 SELECT student_id FROM student_course_attendance WHERE course_id  =  301
 SELECT student_id FROM student_course_attendance WHERE course_id = 301 ORDER BY date_of_attendance DESC LIMIT 1
 SELECT student_id FROM student_course_attendance WHERE course_id = 301 ORDER BY date_of_attendance DESC LIMIT 1
 SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id
 SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id
 SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id JOIN students AS T3 ON T2.person_id = T3.student_id
 SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id JOIN students AS T3 ON T2.person_id = T3.student_id
 SELECT course_name FROM courses ORDER BY course_name
 SELECT course_name FROM courses ORDER BY course_name
 SELECT first_name FROM people ORDER BY first_name
 SELECT first_name FROM people ORDER BY first_name
 SELECT student_id FROM student_course_registrations UNION SELECT student_id FROM student_course_attendance
 SELECT student_id FROM student_course_registrations UNION SELECT student_id FROM student_course_attendance
 SELECT course_id FROM student_course_registrations WHERE student_id = 121 UNION SELECT course_id FROM student_course_attendance WHERE student_id = 121
 SELECT course_id FROM student_course_registrations WHERE student_id = 121 UNION SELECT course_id FROM student_course_attendance WHERE student_id = 121
 SELECT * FROM student_course_registrations WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT * FROM student_course_registrations WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT T2.student_id FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.registration_date
 SELECT student_id FROM student_course_registrations ORDER BY registration_date
 SELECT T2.student_id FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.date_of_attendance
 SELECT T2.student_id FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.date_of_attendance
 SELECT date FROM weather WHERE max_temperature_f  >  85
 SELECT date FROM weather WHERE max_temperature_f  >  85
 SELECT name FROM station WHERE lat  <  37.5
 SELECT name FROM station WHERE lat  <  37.5
 SELECT city ,  max(lat) FROM station GROUP BY city
 SELECT city ,  max(lat) FROM station GROUP BY city
 SELECT start_station_name ,  end_station_name FROM trip ORDER BY id LIMIT 3
 SELECT start_station_name ,  end_station_name FROM trip ORDER BY id LIMIT 3
 SELECT avg(lat) ,  avg(long) FROM station WHERE city  =  "San Jose"
 SELECT avg(lat) ,  avg(long) FROM station WHERE city  =  "San Jose"
 SELECT id FROM trip ORDER BY duration LIMIT 1
 SELECT id FROM trip ORDER BY duration LIMIT 1
 SELECT sum(duration) ,  max(duration) FROM trip WHERE bike_id  =  636
 SELECT sum(duration) ,  max(duration) FROM trip WHERE bike_id  =  636
 SELECT zip_code  ,  avg(mean_temperature_f) FROM weather WHERE date LIKE "8/%" GROUP BY zip_code
 SELECT zip_code  ,  avg(mean_temperature_f) FROM weather WHERE date LIKE "8/%" GROUP BY zip_code
 SELECT count(DISTINCT bike_id) FROM trip
 SELECT count(DISTINCT bike_id) FROM trip
 SELECT count(DISTINCT city) FROM station
 SELECT count(DISTINCT city) FROM station
 SELECT COUNT(*) FROM station WHERE city  =  "Mountain View"
 SELECT COUNT(*) FROM station WHERE city  =  "Mountain View"
 SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7
 SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7
 SELECT start_station_name ,  start_station_id FROM trip WHERE start_date LIKE "8/%" GROUP BY start_station_name ORDER BY COUNT(*) DESC LIMIT 1

 SELECT start_station_name ,  start_station_id FROM trip WHERE start_date LIKE "8/%" GROUP BY start_station_name ORDER BY COUNT(*) DESC LIMIT 1
 SELECT bike_id FROM trip WHERE zip_code  =  94002 GROUP BY bike_id ORDER BY COUNT(*) DESC LIMIT 1
 SELECT bike_id FROM trip WHERE zip_code  =  94002 GROUP BY bike_id ORDER BY COUNT(*) DESC LIMIT 1
 SELECT COUNT(*) FROM weather WHERE mean_humidity  >  50 AND mean_visibility_miles  >  8
 SELECT COUNT(*) FROM weather WHERE mean_humidity  >  50 AND mean_visibility_miles  >  8
 SELECT T1.lat ,  T1.long ,  T1.city FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id ORDER BY T2.duration LIMIT 1
 SELECT T1.lat ,  T1.long ,  T1.city FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id ORDER BY T2.duration LIMIT 1
 SELECT id FROM station WHERE city  =  "San Francisco" INTERSECT SELECT station_id FROM status GROUP BY station_id HAVING avg(bikes_available)  >  10
 SELECT id FROM station WHERE city  =  "San Francisco" INTERSECT SELECT station_id FROM status GROUP BY station_id HAVING avg(bikes_available)  >  10
 SELECT T1.name ,  T1.id FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(T2.bikes_available)  >  14 UNION SELECT name ,  id FROM station WHERE installation_date LIKE "12/%"
 SELECT T1.name ,  T1.id FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(T2.bikes_available)  >  14 UNION SELECT name ,  id FROM station WHERE installation_date LIKE "12/%"
 SELECT cloud_cover FROM weather WHERE zip_code  =  94107 GROUP BY cloud_cover ORDER BY COUNT (*) DESC LIMIT 3
 SELECT cloud_cover FROM weather WHERE zip_code  =  94107 GROUP BY cloud_cover ORDER BY COUNT (*) DESC LIMIT 3
 SELECT zip_code FROM weather GROUP BY zip_code ORDER BY avg(mean_sea_level_pressure_inches) LIMIT 1
 SELECT zip_code FROM weather GROUP BY zip_code ORDER BY avg(mean_sea_level_pressure_inches) LIMIT 1
 SELECT avg(bikes_available) FROM status WHERE station_id NOT IN (SELECT id FROM station WHERE city  =  "Palo Alto")
 SELECT avg(bikes_available) FROM status WHERE station_id NOT IN (SELECT id FROM station WHERE city  =  "Palo Alto")
 SELECT avg(long) FROM station WHERE id NOT IN (SELECT station_id FROM status GROUP BY station_id HAVING max(bikes_available)  >  10)
 SELECT avg(long) FROM station WHERE id NOT IN (SELECT station_id FROM status GROUP BY station_id HAVING max(bikes_available)  >  10)
 SELECT date ,  zip_code FROM weather WHERE max_temperature_f  >=  80
 SELECT date ,  zip_code FROM weather WHERE max_temperature_f  >=  80
 SELECT T1.id FROM trip AS T1 JOIN weather AS T2 ON T1.zip_code  =  T2.zip_code GROUP BY T2.zip_code HAVING avg(T2.mean_temperature_f)  >  60

In [258]:
df2_is['correct'] = np.where(df2_is['open_ai_completion'].str
                                                         .strip()
                                                         .str
                                                         .lower()
                                                         .apply(lambda x: re.sub('\s+', '',x)) == 
                             df2_is['model_response'].str
                                                     .strip()
                                                     .str
                                                     .lower()
                                                     .apply(lambda x: re.sub('\s+', '',x)), 1, 0)

In [259]:
df2_is['correct'].mean()

0.98

In [265]:
print(df2_is[df2_is['correct'] == 0].iloc[0]['open_ai_completion'])
print(df2_is[df2_is['correct'] == 0].iloc[0]['model_response'])

 SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1

 SELECT course_name FROM student_course_registrations GROUP BY course_id ORDER BY count(*) DESC LIMIT 1

## Test out of sample

In [286]:
df2_oos = df2[df2['train_test'] == 'test'][['question', 'db_id', 'query']].head(100)

df2_oos['schema']         = df2_oos.apply(lambda x: get_schema(x['db_id']), axis=1)
df2_oos['schema']         = df2_oos['schema'].apply(splitter)
df2_oos['open_ai_prompt'] = df2_oos.apply(lambda x: short_open_ai_prompt(x), axis=1)
df2_oos['open_ai_completion'] = df2_oos.apply(lambda x: open_ai_completion(x), axis=1)

In [267]:
df2_oos["model_response"] = ""    
df2_oos["model_response"] = df2_oos.apply(call_model_2, axis=1)

 SELECT count(*) FROM management WHERE head_ID  >  56
 SELECT name , born_state , age FROM head ORDER BY age
 SELECT T1.Creation , T1.Name , T1.Budget_in_Billions FROM department AS T1 JOIN head AS T2 ON T1.Department_ID  =  T2.head_ID GROUP BY T1.Department_ID ORDER BY T1.Creation
 SELECT T1.Budget_in_Billions FROM department AS T1 JOIN management AS T2 ON T1.Department_ID = T2.department_ID GROUP BY T2.Department_ID ORDER BY SUM(T2.Budget_in_Billions) LIMIT 1 SELECT T1.Budget_in_Billions FROM department AS T1 JOIN management AS T2 ON T1.Department_ID = T2.department_ID GROUP BY T2.Department_ID ORDER BY MIN(T2.Budget_in_Billions)
 SELECT avg(num_employees) FROM department WHERE rank  BETWEEN 10 AND 15
 SELECT name FROM head WHERE born_state  NOT  LIKE  "California%"
 SELECT DISTINCT(creation) FROM department WHERE head_ID = (SELECT head_ID FROM management WHERE department_ID = (SELECT department_ID FROM department WHERE name = "Human Resources")) AND born_state = "Alabama"
 SELECT name FROM head WHERE born_state IN (SELECT distinct born_state FROM management GROUP BY born_state HAVING count(*) > 3)
 SELECT T1.Creation FROM department AS T1 JOIN head AS T2 ON T1.Department_ID  =  T2.head_ID GROUP BY T1.Creation ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.name ,  count(*) FROM department AS T1 JOIN management AS T2 ON T1.Department_ID = T2.department_ID JOIN head AS T3 ON T2.head_ID = T3.head_ID WHERE T3.temporary_acting = "Yes"
 SELECT count(*) FROM management WHERE temporary_acting
 SELECT count(*) FROM department WHERE head_ID NOT IN (SELECT head_ID FROM management)
 SELECT DISTINCT age FROM management WHERE temporary_acting
 SELECT born_state FROM head WHERE department_id = "Treasury" UNION SELECT born_state FROM head WHERE department_id = "Homeland_Security"
 SELECT T1.name ,  count(*) FROM department AS T1 JOIN management AS T2 ON T1.Department_ID  =  T2.Department_ID GROUP BY T1.Department_ID HAVING count(*)  >  1
 SELECT T1.name ,  T2.name FROM head AS T1 JOIN management AS T2 ON T1.head_id = T2.head_id WHERE T2.temporary_acting LIKE "Ha%"
 SELECT COUNT(*) FROM farm
 SELECT count(*) FROM farm
 SELECT T1.Total_Horses FROM farm AS T1 JOIN T1 ON T1.Farm_ID  =  T2.Farm_ID ORDER BY T1.Total_Horses DESC LIMIT 1
 SELECT T1.Total_Horses FROM farm AS T1 JOIN farm_competition AS T2 ON T1.Farm_ID  =  T2.Host_city_ID GROUP BY T1.Farm_ID ORDER BY T1.Total_Horses DESC
 SELECT hosts FROM competition_record WHERE theme  NOT LIKE "Aliens%"
 SELECT hosts FROM competitions WHERE theme  NOT LIKE "Alien%"
 SELECT T1.Theme FROM farm_competition AS T1 JOIN city AS T2 ON T1.Host_city_ID  =  T2.City_ID ORDER BY T1.Year
 SELECT T1.theme FROM farm_competition AS T1 JOIN competition_record AS T2 ON T1.host_city_id = T2.farm_id ORDER BY T2.year
 SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000
 SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000
 SELECT T1.Population FROM city AS T1 JOIN farm AS T2 ON T1.City_ID  =  T2.Farm_ID GROUP BY T2.Farm_ID ORDER BY COUNT(*) LIMIT 1 SELECT T1.Population FROM city AS T1 JOIN farm AS T2 ON T1.City_ID  =  T2.Farm_ID GROUP BY T2.Farm_ID ORDER BY MIN(COUNT(*)),MAX(COUNT(*) LIMIT 1
 SELECT T1.Population ,  T2.Population FROM city GROUP BY T1.Population ORDER BY T1.Population LIMIT 1
 SELECT count(DISTINCT "Status") FROM "city"
 SELECT count(DISTINCT "Status") FROM "city"
 SELECT T1.Official_Name FROM city AS T1 ORDER BY T1.Population DESC
 SELECT T1.Official_Name FROM city AS T1 ORDER BY T1.Population DESC
 SELECT T1.Official_Name ,  T1.Status FROM city AS T1 JOIN city AS T2 ON T1.City_ID  =  T2.City_ID ORDER BY T2.Population LIMIT 1
 SELECT T1.Official_Name , T1.Status FROM city GROUP BY T1.Official_Name ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.Year , T2.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID
 SELECT T1.Year , T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID
 SELECT T1.Official_Name FROM city AS T1 JOIN competition_record AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T1.City_ID HAVING COUNT(*)  >  1
 SELECT official_name FROM city WHERE city_id  >  1
 SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1
 SELECT "Status" FROM "city" WHERE "City_ID" = (SELECT "Host_city_ID" FROM "farm_competition")
 SELECT T1.`Theme` FROM `farm_competition` AS T1 JOIN `city` AS T2 ON T1.`Host_city_ID` = T2.`City_ID` WHERE T2.`Population` > 1000
 SELECT T1.theme FROM competition_record AS T1 JOIN city AS T2 ON T1.host_city_id  =  T2.city_id GROUP BY T2.city_id HAVING COUNT(*)  >  1000
 SELECT DISTINCT T1.Status , avg(T2.Population) FROM city AS T1 JOIN city AS T2 ON T1.City_ID  =  T2.City_ID GROUP BY T1.Status
 SELECT T1.Status ,  avg(T2.Population) FROM city AS T1 JOIN city AS T2 ON T1.City_ID  =  T2.City_ID GROUP BY T1.Status
 SELECT DISTINCT T1.Status ,  count(*) FROM city GROUP BY T1.Status ORDER BY count(*) DESC
 SELECT DISTINCT T1.Status FROM city AS T1 GROUP BY T1.Status ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.value  FROM city AS T1 JOIN city AS T2 ON T1.City_ID  =  T2.City_ID GROUP BY T2.Status ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.Status FROM city AS T1 JOIN city AS T2 ON T1.City_ID  =  T2.City_ID GROUP BY T1.Status ORDER BY COUNT(*) DESC LIMIT 1
 SELECT Official_Name FROM city WHERE NOT EXISTS (SELECT Competition_ID FROM farm_competition WHERE City_ID  =  the_city_id)
 SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)
 SELECT "Status" FROM "city" WHERE "Population"  >  1500 AND "Population"  <  500
 SELECT "Status" FROM "city" WHERE "Population"  >  1500 UNION SELECT "Status" FROM "city" WHERE "Population"  <  500
 SELECT Official_Name FROM city WHERE Population > 1500 UNION SELECT Official_Name FROM city WHERE Population < 500
 SELECT "Official_Name" FROM "city" WHERE "Population"  >  1500 UNION SELECT "Official_Name" FROM "city" WHERE "Population"  <  500
 SELECT "Census_Ranking" FROM "city" WHERE "Status" NOT LIKE "Village/%"
 SELECT T1.Census_Ranking FROM city AS T1 JOIN city AS T2 ON T1.City_ID = T2.City_ID WHERE T2.Status NOT LIKE "Village%"
 SELECT count(*) FROM book
 SELECT Writer FROM book ORDER BY Writer
 SELECT title FROM book ORDER BY issues
 SELECT title FROM book WHERE writer != "Elaine Lee"
 SELECT title , issues FROM book
 SELECT Publication_Date FROM publication ORDER BY Price DESC
 SELECT DISTINCT T1.Publisher FROM publication AS T1 WHERE T1.Price > 5000000
 SELECT T1.publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID GROUP BY T1.publisher ORDER BY T2.Price LIMIT 1
 SELECT Publication_Date FROM publication GROUP BY Publication_ID ORDER BY Price LIMIT 3
 SELECT T1.title ,  T2.publication_date FROM book AS T1 JOIN publication AS T2 ON T1.book_id = T2.book_id
 SELECT T1.writer FROM book AS T1 JOIN publication AS T2 ON T1.book_id = T2.book_id WHERE T2.price > 4000000
 SELECT T1.title FROM book AS T1 JOIN publication AS T2 ON T1.book_id = T2.book_id ORDER BY T2.price DESC
 SELECT publisher FROM publication WHERE count(*) > 1
 SELECT DISTINCT T1.publisher ,  count(*) FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID GROUP BY T1.publisher
 SELECT T1.Publication_Date FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID GROUP BY T1.Publication_Date ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.Writer FROM book AS T1 JOIN book AS T2 ON T1.Book_ID  =  T2.Book_ID GROUP BY T1.Book_ID HAVING count(*)  >  1
 SELECT title FROM book WHERE book_id NOT IN (SELECT publication_id FROM publication)
 SELECT T1.name FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T1.price > 10000000 UNION SELECT T1.name FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T1.price < 5000000
 SELECT count(DISTINCT "Publication_Date") FROM "publication"
 SELECT count(DISTINCT "Publication_Date") FROM "publication"
 SELECT T1.Price FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID JOIN publisher AS T3 ON T2.Publisher = T3.Name WHERE T3.Name LIKE "Person%" || "|" || "Wiley%"
 SELECT T1.catalog_entry_name FROM catalog_entries AS T1

 SELECT DISTINCT T1.`catalog_entry_name` FROM `Catalog_Contents` AS T1 JOIN `Catalog_Entries` AS T2 ON T1.`parent_entry_id` = T2.`entry_id`
 SELECT T1.attribute_data_type FROM attribute_definitions AS T1 JOIN attribute_definitions AS T2 ON T1.attribute_id = T2.attribute_id JOIN attribute_definitions AS T3 ON T2.attribute_id = T3.attribute_id GROUP BY T2.attribute_id HAVING count(*) > 3
 SELECT attribute_name FROM attribute_definitions GROUP BY attribute_name HAVING COUNT(*) > 3
 SELECT attribute_data_type FROM attribute_definitions WHERE attribute_name = "Green"
 SELECT attribute_data_type FROM attribute_definitions WHERE attribute_name = "Green"
 SELECT T1.catalog_level_name ,  T2.catalog_level_number FROM catalog_structure AS T1 JOIN catalog_level_number AS T2 ON T1.catalog_id  =  T2.catalog_id WHERE T1.catalog_level_number  BETWEEN  5 AND 10
 SELECT T1.catalog_level_name , T1.catalog_level_number FROM catalog_structure WHERE catalog_level_number BETWEEN 5 AND 10
 SELECT T1.name FROM catalog_publisher AS T1 JOIN catalogs AS T2 ON T1.publisher_id = T2.catalog_publisher_id WHERE T2.name LIKE "Murray%"
 SELECT T1.catalog_publisher FROM catalogs AS T1 JOIN catalog_publishers AS T2 ON T1.catalog_publisher = T2.publisher WHERE T2.publisher LIKE "Murray%"
 SELECT T1.catalog_publisher FROM catalogs AS T1 JOIN catalog_structure AS T2 ON T1.catalog_id = T2.catalog_id GROUP BY T2.catalog_publisher ORDER BY count(*) DESC LIMIT 1
 SELECT T1.catalog_publisher FROM catalogs AS T1 JOIN catalog_contents AS T2 ON T1.catalog_id  =  T2.parent_entry_id GROUP BY T1.catalog_publisher ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.catalog_name ,  T1.date_of_publication FROM catalogs AS T1 JOIN catalog_structure AS T2 ON T1.catalog_id = T2.catalog_id GROUP BY T2.catalog_id HAVING avg(T2.catalog_level_number)  >  5
 SELECT T1.catalog_name ,  T2.date_of_publication FROM catalogs AS T1 JOIN catalog_structure AS T2 ON T1.catalog_id  =  T2.catalog_id WHERE T2.catalog_level_number  >  5
 SELECT T1.catalog_entry_name FROM catalog_contents AS T1 JOIN catalog_contents_additional_attributes AS T2 ON T1.catalog_entry_id = T2.catalog_entry_id GROUP BY T2.attribute_id ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.catalog_entry_name FROM `Catalog_Contents` AS T1 JOIN `Catalog_Contents_Additional_Attributes` AS T2 ON T1.catalog_entry_id = T2.catalog_entry_id GROUP BY T2.attribute_id ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.catalog_entry_name FROM catalog_contents AS T1 JOIN catalog_contents_additional_attributes AS T2 ON T1.catalog_entry_id = T2.catalog_entry_id WHERE T2.attribute_value  =  "100" GROUP BY T2.attribute_id ORDER BY SUM(T2.attribute_value) LIMIT 1
 SELECT T1.catalog_entry_name FROM catalog_contents AS T1 JOIN catalog_contents_additional_attributes AS T2 ON T1.catalog_entry_id = T2.catalog_entry_id GROUP BY T2.attribute_value ORDER BY T2.attribute_value LIMIT 1
 SELECT T1.level_name FROM catalog_level_name AS T1 JOIN catalog_level_number AS T2 ON T1.level_name = T2.level_name GROUP BY T2.level_name ORDER BY T2.level_name LIMIT 1
 SELECT T1.catalog_level_name FROM catalog_contents AS T1 JOIN catalog_contents_additional_attributes AS T2 ON T1.catalog_entry_id = T2.catalog_entry_id WHERE T2.attribute_value =
 SELECT avg(price_in_euros) , min(price_in_euros) FROM products
 SELECT avg(price_in_euros) , min(price_in_euros) FROM products
 SELECT T1.catalog_entry_name FROM catalog_entries AS T1 JOIN catalog_entries_additional_attributes AS T2 ON T1.catalog_entry_id = T2.catalog_entry_id GROUP BY T2.attribute_id ORDER BY T2.attribute_value LIMIT 1

In [269]:
df2_oos['correct'] = np.where(df2_oos['open_ai_completion'].str
                                                           .strip()
                                                           .str
                                                           .lower()
                                                           .apply(lambda x: re.sub('\s+', '',x)) == 
                              df2_oos['model_response'].str
                                                       .strip()
                                                       .str
                                                       .lower()
                                                       .apply(lambda x: re.sub('\s+', '',x)), 1, 0)

In [270]:
df2_oos['correct'].mean()

0.16

In [271]:
print(df2_oos[df2_oos['correct'] == 0].iloc[0]['open_ai_completion'])
print(df2_oos[df2_oos['correct'] == 0].iloc[0]['model_response'])

 SELECT count(*) FROM head WHERE age  >  56

 SELECT count(*) FROM management WHERE head_ID  >  56

# 100 -> 350 training examples
96% correct in sample  
23% correct out of sample  

Restrcited to single-table queries only:  
98% correct in sample
34% correct out of sample

In [276]:
df2_is_350 = df2[df2['train_test'] == 'train'][['question', 'db_id', 'query']].head(350)

df2_is_350['schema']         = df2_is_350.apply(lambda x: get_schema(x['db_id']), axis=1)
df2_is_350['schema']         = df2_is_350['schema'].apply(splitter)
df2_is_350['open_ai_prompt'] = df2_is_350.apply(lambda x: short_open_ai_prompt(x), axis=1)
df2_is_350['open_ai_completion'] = df2_is_350.apply(lambda x: open_ai_completion(x), axis=1)

In [277]:
# Put the training data into jsonl format
data = []
for idx, row in df2_is_350.iterrows():
    data.append({"prompt": row["open_ai_prompt"], "completion": row["open_ai_completion"]})

timestr = time.strftime("%Y%m%d-%H%M%S")
with open("spider_open_ai_fine_tuning_" + timestr + ".jsonl", "w") as outfile:
    for obj in data:
        json.dump(obj, outfile)
        outfile.write("\n")

In [ ]:
#!openai tools fine_tunes.prepare_data -f spider_open_ai_fine_tuning_20230117-174446.jsonl

In [ ]:
#!openai api fine_tunes.create -t spider_open_ai_fine_tuning_20230117-174446.jsonl -m davinci

In [279]:
!openai api fine_tunes.list

{
  "data": [
    {
      "created_at": 1672357089,
      "fine_tuned_model": "davinci:ft-mercator-2022-12-29-23-47-24",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-ZMShnMrnhxzay9r0mXXEcxyI",
      "model": "davinci",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 7017,
          "created_at": 1672357645,
          "filename": "compiled_results.csv",
          "id": "file-FdDaGVVXGWC08jN4NwodgYnY",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 3380,
          "created_at": 1672357089,
          "filename": "openai_classification_fine_tuning.txt",
          "id": "file-APupvHFP5OaeEWNg6SVT8uyK",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1672357645,
      "validation_files": []
    },
    {
      "created_at": 1672359981,
      "fine_tuned_model": "curie:ft-mercator-2022-12-30-00-29-13",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-Ej8Q7PDuU2mwaFWZ6Pz6Nx3a",
      "model": "curie",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 7137,
          "created_at": 1672360154,
          "filename": "compiled_results.csv",
          "id": "file-rfuxlRqwBKEZ3FKQYU1FhTbE",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 3780,
          "created_at": 1672359981,
          "filename": "openai_classification_fine_tuning.jsonl",
          "id": "file-L3OyASJECTFdDTj9WWdbFyCW",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1672360154,
      "validation_files": []
    },
    {
      "created_at": 1672361065,
      "fine_tuned_model": "davinci:ft-mercator-2022-12-30-00-48-03",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-UYqkIaV7CZS9aLfFZ1EVw0GC",
      "model": "davinci",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 7070,
          "created_at": 1672361285,
          "filename": "compiled_results.csv",
          "id": "file-OJfSWHvKVsj7hUv8XIKzw109",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 3780,
          "created_at": 1672361065,
          "filename": "openai_classification_fine_tuning.jsonl",
          "id": "file-q6jZNWXC2Qox3FS1PMB0wDy9",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1672361285,
      "validation_files": []
    },
    {
      "created_at": 1672363107,
      "fine_tuned_model": "davinci:ft-mercator-2022-12-30-01-27-07",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,

      },
      "id": "ft-CM32gCt2Qt7MaZGvg6C2626j",
      "model": "davinci",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 50099,
          "created_at": 1672363628,
          "filename": "compiled_results.csv",
          "id": "file-7gxyT041xSQS9nuBjOqrlfal",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 32328,
          "created_at": 1672363107,
          "filename": "openai_classification_fine_tuning.jsonl",
          "id": "file-hi3zqKcuTO2hMY4Tn3gkNECq",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1672363628,
      "validation_files": []
    },
    {
      "created_at": 1673633601,
      "fine_tuned_model": "curie:ft-mercator-2023-01-13-18-58-25",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-ktXHwqMgjQuLOdSsEZEXKy90",
      "model": "curie",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 11017,
          "created_at": 1673636305,
          "filename": "compiled_results.csv",
          "id": "file-g7wzj1pyMxhlF6SKCnWCwLy5",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 888550,
          "created_at": 1673633600,
          "filename": "spider_open_ai_fine_tuning.jsonl",
          "id": "file-HmlGzvAbawZ51iOGs1VxQgKL",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1673636306,
      "validation_files": []
    },
    {
      "created_at": 1673633730,
      "fine_tuned_model": "davinci:ft-mercator-2023-01-13-21-03-38",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-uvli4ARlKMy5Gy2C5zHHV1eD",
      "model": "davinci",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 10941,
          "created_at": 1673643819,
          "filename": "compiled_results.csv",
          "id": "file-gvWI9O3cGLLbzC0WNSgda94t",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 888550,
          "created_at": 1673633717,
          "filename": "spider_open_ai_fine_tuning.jsonl",
          "id": "file-plLUrjyA7M8igrCZtMKFevyV",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1673643822,
      "validation_files": []
    },
    {
      "created_at": 1673642119,
      "fine_tuned_model": "davinci:ft-mercator-2023-01-13-23-39-57",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-IArp6w0FdYZ2D8msrWTqPhkp",
      "model": "davinci",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {

          "created_at": 1673653199,
          "filename": "compiled_results.csv",
          "id": "file-J70Nszr4efYx1gpHS9rqzwIw",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 866650,
          "created_at": 1673642115,
          "filename": "spider_short_prompt_open_ai_fine_tuning.jsonl",
          "id": "file-HonZQBmGAVsESaNYQV8IDLse",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1673653199,
      "validation_files": []
    },
    {
      "created_at": 1673651109,
      "fine_tuned_model": "davinci:ft-mercator-2023-01-14-01-47-14",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-Ihg26q1fpDVSCF9i8rwVOf4o",
      "model": "davinci",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 19961,
          "created_at": 1673660835,
          "filename": "compiled_results.csv",
          "id": "file-7f1VIToPw5gRweQb3UZnAsDD",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 159674,
          "created_at": 1673651108,
          "filename": "spider_short_prompt_open_ai_fine_tuning.jsonl",
          "id": "file-WZz9r1jfHZt6qhsdFS5xMKD6",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1673660836,
      "validation_files": []
    },
    {
      "created_at": 1673998663,
      "fine_tuned_model": "davinci:ft-mercator-2023-01-18-00-37-55",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-dbeUsmj0k5FG0GnnDMJ3s05c",
      "model": "davinci",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 19876,
          "created_at": 1674002276,
          "filename": "compiled_results.csv",
          "id": "file-EHcQOFAFnnr0XMxRYIxWw2w4",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 201213,
          "created_at": 1673998663,
          "filename": "spider_open_ai_fine_tuning_20230117-153523.jsonl",
          "id": "file-hzwl04Vk88WfsnthvJXnSU4t",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1674002277,
      "validation_files": []
    },
    {
      "created_at": 1674006408,
      "fine_tuned_model": "davinci:ft-mercator-2023-01-18-02-13-35",
      "hyperparams": {
        "batch_size": 1,
        "learning_rate_multiplier": 0.1,
        "n_epochs": 4,
        "prompt_loss_weight": 0.01
      },
      "id": "ft-B5wO3kuwXoUTGRwpdDVMfbRS",
      "model": "davinci",
      "object": "fine-tune",
      "organization_id": "org-ePmgB4qVo14GgUKdUQci6IGz",
      "result_files": [
        {
          "bytes": 69793,
          "created_at": 1674008016,
          "filename": "compiled_results.csv",
          "id": "file-hXDw174L2989gxVJg0749sts",
          "object": "file",
          "purpose": "fine-tune-results",
          "status": "processed",
          "status_details": null
        }
      ],
      "status": "succeeded",
      "training_files": [
        {
          "bytes": 430197,
          "created_at": 1674006408,
          "filename": "spider_open_ai_fine_tuning_20230117-174446.jsonl",
          "id": "file-mgqafpnvg6j8iXvK9ZjCtjqN",
          "object": "file",
          "purpose": "fine-tune",
          "status": "processed",
          "status_details": null
        }
      ],
      "updated_at": 1674008017,
      "validation_files": []
    }
  ],
  "object": "list"
}

In [298]:
def call_model_350(row):
    prompt = row["open_ai_prompt"]
    
    try:
        completions = openai.Completion.create(
            engine="davinci:ft-mercator-2023-01-18-02-13-35",
            prompt=prompt,
            max_tokens=1024,
            n=1,
            stop=["\n"],
            temperature=0.5
        )

        print(completions.choices[0].text)
        return completions.choices[0].text
    
    except:
        return None

## Test in sample

In [281]:
df2_is_350["model_response"] = ""    
df2_is_350["model_response"] = df2_is_350.apply(call_model_350, axis=1)

 SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1
 SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1
 SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1
 SELECT T1.first_name ,  T1.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id
 SELECT T1.first_name ,  T1.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id
 SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT student_id FROM student_course_attendance
 SELECT student_id FROM student_course_attendance
 SELECT T2.student_id ,  T2.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id
 SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1
 SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171
 SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171
 SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"
 SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"
 SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1
 SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1
 SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
 SELECT T2.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id
 SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id
 SELECT T1.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id
 SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id
 SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"
 SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"
 SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"
 SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"
 SELECT student_id FROM student_course_attendance WHERE course_id  =  301
 SELECT student_id FROM student_course_attendance WHERE course_id  =  301
 SELECT student_id FROM student_course_attendance WHERE course_id = 301 ORDER BY date_of_attendance DESC LIMIT 1
 SELECT student_id FROM student_course_attendance WHERE course_id = 301 ORDER BY date_of_attendance DESC LIMIT 1
 SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id
 SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id
 SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id JOIN students AS T3 ON T2.person_id = T3.student_id
 SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id JOIN students AS T3 ON T2.person_id = T3.student_id
 SELECT course_name FROM courses ORDER BY course_name
 SELECT course_name FROM courses ORDER BY course_name
 SELECT first_name FROM people ORDER BY first_name
 SELECT first_name FROM people ORDER BY first_name
 SELECT T1.student_id FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id WHERE T1.student_id NOT IN (SELECT student_id FROM student_course_attendance AS T4 WHERE T4.student_id = T1.student_id)
 SELECT student_id FROM student_course_registrations UNION SELECT student_id FROM student_course_attendance
 SELECT course_id FROM student_course_registrations WHERE student_id = 121 UNION SELECT course_id FROM student_course_attendance WHERE student_id = 121
 SELECT course_id FROM student_course_registrations WHERE student_id = 121 UNION SELECT course_id FROM student_course_attendance WHERE student_id = 121
 SELECT * FROM student_course_registrations WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT * FROM student_course_registrations WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
 SELECT T2.student_id FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.registration_date
 SELECT T2.student_id FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.registration_date
 SELECT T2.student_id FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.date_of_attendance
 SELECT T2.student_id FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.date_of_attendance
 SELECT date FROM weather WHERE max_temperature_f  >  85
 SELECT date FROM weather WHERE max_temperature_f  >  85
 SELECT name FROM station WHERE lat  <  37.5
 SELECT name FROM station WHERE lat  <  37.5
 SELECT city ,  max(lat) FROM station GROUP BY city
 SELECT city ,  max(lat) FROM station GROUP BY city
 SELECT start_station_name ,  end_station_name FROM trip ORDER BY id LIMIT 3
 SELECT start_station_name ,  end_station_name FROM trip ORDER BY id LIMIT 3
 SELECT avg(lat) ,  avg(long) FROM station WHERE city  =  "San Jose"
 SELECT avg(lat) ,  avg(long) FROM station WHERE city  =  "San Jose"
 SELECT id FROM trip ORDER BY duration LIMIT 1
 SELECT id FROM trip ORDER BY duration LIMIT 1
 SELECT sum(duration) ,  max(duration) FROM trip WHERE bike_id  =  636
 SELECT sum(duration) ,  max(duration) FROM trip WHERE bike_id  =  636
 SELECT zip_code  ,  avg(mean_temperature_f) FROM weather WHERE date LIKE "8/%" GROUP BY zip_code
 SELECT zip_code  ,  avg(mean_temperature_f) FROM weather WHERE date LIKE "8/%" GROUP BY zip_code
 SELECT count(DISTINCT bike_id) FROM trip
 SELECT count(DISTINCT bike_id) FROM trip
 SELECT count(DISTINCT city) FROM station
 SELECT count(DISTINCT city) FROM station
 SELECT COUNT(*) FROM station WHERE city  =  "Mountain View"

 SELECT COUNT(*) FROM station WHERE city  =  "Mountain View"
 SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7
 SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7
 SELECT start_station_name ,  start_station_id FROM trip WHERE start_date LIKE "8/%" GROUP BY start_station_name ORDER BY COUNT(*) DESC LIMIT 1
 SELECT start_station_name ,  start_station_id FROM trip WHERE start_date LIKE "8/%" GROUP BY start_station_name ORDER BY COUNT(*) DESC LIMIT 1
 SELECT bike_id FROM trip WHERE zip_code  =  94002 GROUP BY bike_id ORDER BY COUNT(*) DESC LIMIT 1
 SELECT bike_id FROM trip WHERE zip_code  =  94002 GROUP BY bike_id ORDER BY COUNT(*) DESC LIMIT 1
 SELECT COUNT(*) FROM weather WHERE mean_humidity  >  50 AND mean_visibility_miles  >  8
 SELECT COUNT(*) FROM weather WHERE mean_humidity  >  50 AND mean_visibility_miles  >  8
 SELECT T1.lat ,  T1.long ,  T1.city FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id ORDER BY T2.duration LIMIT 1
 SELECT T1.lat ,  T1.long ,  T1.city FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id ORDER BY T2.duration LIMIT 1
 SELECT id FROM station WHERE city  =  "San Francisco" INTERSECT SELECT station_id FROM status GROUP BY station_id HAVING avg(bikes_available)  >  10
 SELECT id FROM station WHERE city  =  "San Francisco" INTERSECT SELECT station_id FROM status GROUP BY station_id HAVING avg(bikes_available)  >  10
 SELECT T1.name ,  T1.id FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(T2.bikes_available)  >  14 UNION SELECT name ,  id FROM station WHERE installation_date LIKE "12/%"
 SELECT T1.name ,  T1.id FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(bikes_available)  >  14 UNION SELECT name ,  id FROM station WHERE installation_date LIKE "12/%"
 SELECT cloud_cover FROM weather WHERE zip_code  =  94107 GROUP BY cloud_cover ORDER BY COUNT (*) DESC LIMIT 3
 SELECT cloud_cover FROM weather WHERE zip_code  =  94107 GROUP BY cloud_cover ORDER BY COUNT (*) DESC LIMIT 3
 SELECT zip_code FROM weather GROUP BY zip_code ORDER BY avg(mean_sea_level_pressure_inches) LIMIT 1
 SELECT zip_code FROM weather GROUP BY zip_code ORDER BY avg(mean_sea_level_pressure_inches) LIMIT 1
 SELECT avg(bikes_available) FROM status WHERE station_id NOT IN (SELECT id FROM station WHERE city  =  "Palo Alto")
 SELECT avg(bikes_available) FROM status WHERE station_id NOT IN (SELECT id FROM station WHERE city  =  "Palo Alto")
 SELECT avg(long) FROM station WHERE id NOT IN (SELECT station_id FROM status GROUP BY station_id HAVING max(bikes_available)  >  10)
 SELECT avg(long) FROM station WHERE id NOT IN (SELECT station_id FROM status GROUP BY station_id HAVING max(bikes_available)  >  10)
 SELECT date ,  zip_code FROM weather WHERE max_temperature_f  >=  80
 SELECT date ,  zip_code FROM weather WHERE max_temperature_f  >=  80
 SELECT T1.id FROM trip AS T1 JOIN weather AS T2 ON T1.zip_code  =  T2.zip_code GROUP BY T2.zip_code HAVING avg(T2.mean_temperature_f)  >  60
 SELECT T1.id FROM trip AS T1 JOIN weather AS T2 ON T1.zip_code  =  T2.zip_code GROUP BY T2.zip_code HAVING avg(T2.mean_temperature_f)  >  60
 SELECT zip_code , count(*) FROM weather WHERE max_wind_Speed_mph  >=  25 GROUP BY zip_code
 SELECT zip_code , count(*) FROM weather WHERE max_wind_Speed_mph  >=  25 GROUP BY zip_code
 SELECT date ,  zip_code FROM weather WHERE min_dew_point_f  <  (SELECT min(min_dew_point_f) FROM weather WHERE zip_code  =  94107)
 SELECT date ,  zip_code FROM weather WHERE min_dew_point_f  <  (SELECT min(min_dew_point_f) FROM weather WHERE zip_code  =  94107)
 SELECT T1.id ,  T2.installation_date FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id
 SELECT T1.id ,  T2.installation_date FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id
 SELECT T1.id FROM trip AS T1 JOIN station AS T2 ON T1.start_station_id  =  T2.id ORDER BY T2.dock_count DESC LIMIT 1
 SELECT T1.id FROM trip AS T1 JOIN station AS T2 ON T1.start_station_id  =  T2.id ORDER BY T2.dock_count DESC LIMIT 1
 SELECT count(*) FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id WHERE T2.city !=  "San Francisco"
 SELECT count(*) FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id WHERE T2.city != "San Francisco"
 SELECT date FROM weather WHERE zip_code  =  94107 AND EVENTS != "Fog" AND EVENTS != "Rain"
 SELECT date FROM weather WHERE zip_code  =  94107 AND EVENTS != "Fog" AND EVENTS != "Rain"
 SELECT id FROM station WHERE lat  >  37.4 EXCEPT SELECT station_id FROM status GROUP BY station_id HAVING min(bikes_available)  <  7
 SELECT id FROM station WHERE lat  >  37.4 EXCEPT SELECT station_id FROM status GROUP BY station_id HAVING min(bikes_available)  <  7
 SELECT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(bikes_available)  >  10 EXCEPT SELECT name FROM station WHERE city  =  "San Jose"
 SELECT name FROM station WHERE bikes_available  >  10 EXCEPT SELECT name FROM station WHERE city  =  "San Jose"
 SELECT name ,  lat ,  city FROM station ORDER BY lat LIMIT 1
 SELECT name ,  lat ,  city FROM station ORDER BY lat LIMIT 1
 SELECT date ,  mean_temperature_f ,  mean_humidity FROM weather ORDER BY max_gust_speed_mph DESC LIMIT 3
 SELECT date ,  mean_temperature_f ,  mean_humidity FROM weather ORDER BY max_gust_speed_mph DESC LIMIT 3
 SELECT city ,  COUNT(*) FROM station GROUP BY city HAVING COUNT(*)  >=  15
 SELECT city ,  COUNT(*) FROM station GROUP BY city HAVING COUNT(*)  >=  15
 SELECT start_station_id ,  start_station_name FROM trip GROUP BY start_station_name HAVING COUNT(*)  >=  200
 SELECT start_station_id ,  start_station_name FROM trip GROUP BY start_station_name HAVING COUNT(*)  >=  200
 SELECT zip_code FROM weather GROUP BY zip_code HAVING avg(mean_visibility_miles)  <  10
 SELECT zip_code FROM weather GROUP BY zip_code HAVING avg(mean_visibility_miles)  <  10
 SELECT city FROM station GROUP BY city ORDER BY max(lat) DESC
 SELECT city FROM station GROUP BY city ORDER BY max(lat) DESC
 SELECT date ,  cloud_cover FROM weather ORDER BY cloud_cover DESC LIMIT 5
 SELECT date ,  cloud_cover FROM weather ORDER BY cloud_cover DESC LIMIT 5
 SELECT id ,  duration FROM trip ORDER BY duration DESC LIMIT 3
 SELECT id ,  duration FROM trip ORDER BY duration DESC LIMIT 3
 SELECT T1.name ,  T1.long ,  avg(T2.duration) FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id GROUP BY T2.start_station_id
 SELECT T1.name ,  T1.long ,  avg(T2.duration) FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id GROUP BY T2.start_station_id
 SELECT T1.name ,  T1.lat ,  min(T2.duration) FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.end_station_id GROUP BY T2.end_station_id
 SELECT T1.name ,  T1.lat ,  min(T2.duration) FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.end_station_id GROUP BY T2.end_station_id
 SELECT DISTINCT start_station_name FROM trip WHERE duration  <  100
 SELECT DISTINCT start_station_name FROM trip WHERE duration  <  100
 SELECT DISTINCT zip_code FROM weather EXCEPT SELECT DISTINCT zip_code FROM weather WHERE max_dew_point_f  >=  70
 SELECT DISTINCT zip_code FROM weather EXCEPT SELECT DISTINCT zip_code FROM weather WHERE max_dew_point_f  >=  70
 SELECT id FROM trip WHERE duration  >=  (SELECT avg(duration) FROM trip WHERE zip_code  =  94103)
 SELECT id FROM trip WHERE duration  >=  (SELECT avg(duration) FROM trip WHERE zip_code  =  94103)
 SELECT date FROM weather WHERE mean_sea_level_pressure_inches BETWEEN 30.3 AND 31
 SELECT date FROM weather WHERE mean_sea_level_pressure_inches BETWEEN 30.3 AND 31
 SELECT date ,  max_temperature_f - min_temperature_f FROM weather ORDER BY max_temperature_f - min_temperature_f LIMIT 1
 SELECT date ,  max_temperature_f - min_temperature_f FROM weather ORDER BY max_temperature_f - min_temperature_f LIMIT 1
 SELECT DISTINCT T1.id ,  T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  >  12
 SELECT DISTINCT T1.id ,  T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  >  12

 SELECT zip_code FROM weather GROUP BY zip_code HAVING avg(mean_humidity)  <  70 INTERSECT SELECT zip_code FROM trip GROUP BY zip_code HAVING count(*)  >=  100
 SELECT zip_code FROM weather GROUP BY zip_code HAVING avg(mean_humidity)  <  70 INTERSECT SELECT zip_code FROM trip GROUP BY zip_code HAVING count(*)  >=  100
 SELECT name FROM station WHERE city  =  "Palo Alto" EXCEPT SELECT end_station_name FROM trip GROUP BY end_station_name HAVING count(*)  >  100
 SELECT name FROM station WHERE city  =  "Palo Alto" EXCEPT SELECT end_station_name FROM trip GROUP BY end_station_name HAVING count(*)  >  100
 SELECT count(*) FROM station AS T1 JOIN trip AS T2 JOIN station AS T3 JOIN trip AS T4 ON T1.id  =  T2.start_station_id AND T2.id  =  T4.id AND T3.id  =  T4.end_station_id WHERE T1.city  =  "Mountain View" AND T3.city  =  "Palo Alto"
 SELECT count(*) FROM station AS T1 JOIN trip AS T2 JOIN station AS T3 JOIN trip AS T4 ON T1.id  =  T2.start_station_id AND T2.id  =  T4.id AND T3.id  =  T4.end_station_id WHERE T1.city  =  "Mountain View" AND T3.city  =  "Palo Alto"
 SELECT avg(T1.lat) ,  avg(T1.long) FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id
 SELECT avg(T1.lat) ,  avg(T1.long) FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id
 SELECT count(*) FROM actor
 SELECT count(*) FROM actor
 SELECT Name FROM actor ORDER BY Name ASC
 SELECT Name FROM actor ORDER BY Name ASC
 SELECT Character ,  Duration FROM actor
 SELECT Character ,  Duration FROM actor
 SELECT Name FROM actor WHERE Age != 20
 SELECT Name FROM actor WHERE Age != 20
 SELECT Character FROM actor ORDER BY age DESC
 SELECT Character FROM actor ORDER BY age DESC
 SELECT Duration FROM actor ORDER BY Age DESC LIMIT 1
 SELECT Duration FROM actor ORDER BY Age DESC LIMIT 1
 SELECT Name FROM musical WHERE Nominee  =  "Bob Fosse"
 SELECT Name FROM musical WHERE Nominee  =  "Bob Fosse"
 SELECT DISTINCT Nominee FROM musical WHERE Award != "Tony Award"
 SELECT DISTINCT Nominee FROM musical WHERE Award != "Tony Award"
 SELECT T1.Name ,  T2.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID
 SELECT T1.Name ,  T2.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID
 SELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID WHERE T2.Name  =  "The Phantom of the Opera"
 SELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID WHERE T2.Name  =  "The Phantom of the Opera"
 SELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC
 SELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC
 SELECT T2.Name ,  COUNT(*) FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID GROUP BY T1.Musical_ID
 SELECT T2.Name ,  COUNT(*) FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID GROUP BY T1.Musical_ID
 SELECT T2.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID GROUP BY T1.Musical_ID HAVING COUNT(*)  >=  3
 SELECT T2.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID GROUP BY T1.Musical_ID HAVING COUNT(*)  >=  3
 SELECT Nominee ,  COUNT(*) FROM musical GROUP BY Nominee
 SELECT Nominee ,  COUNT(*) FROM musical GROUP BY Nominee
 SELECT Nominee FROM musical GROUP BY Nominee ORDER BY COUNT(*) DESC LIMIT 1
 SELECT Nominee FROM musical GROUP BY Nominee ORDER BY COUNT(*) DESC LIMIT 1
 SELECT RESULT FROM musical GROUP BY RESULT ORDER BY COUNT(*) DESC LIMIT 1
 SELECT RESULT FROM musical GROUP BY RESULT ORDER BY COUNT(*) DESC LIMIT 1
 SELECT Nominee FROM musical GROUP BY Nominee HAVING COUNT(*)  >  2
 SELECT Nominee FROM musical GROUP BY Nominee HAVING COUNT(*)  >  2
 SELECT Name FROM musical WHERE Musical_ID NOT IN (SELECT Musical_ID FROM actor)
 SELECT Name FROM musical WHERE Musical_ID NOT IN (SELECT Musical_ID FROM actor)
 SELECT Nominee FROM musical WHERE Award  =  "Tony Award" INTERSECT SELECT Nominee FROM musical WHERE Award  =  "Drama Desk Award"
 SELECT Nominee FROM musical WHERE Award  =  "Tony Award" INTERSECT SELECT Nominee FROM musical WHERE Award  =  "Drama Desk Award"
 SELECT Nominee FROM musical WHERE Award  =  "Tony Award" OR Award  =  "Cleavant Derricks"
 SELECT Nominee FROM musical WHERE Award  =  "Tony Award" OR Award  =  "Cleavant Derricks"
 SELECT email FROM user_profiles WHERE name  =  'Mary'
 SELECT partitionid FROM user_profiles WHERE name  =  'Iron Man'
 SELECT count(*) FROM user_profiles
 SELECT count(*) FROM follows
 SELECT count(*) FROM follows
 SELECT count(*) FROM tweets
 SELECT count(DISTINCT UID) FROM tweets
 SELECT name ,  email FROM user_profiles WHERE name LIKE '%Swift%'
 SELECT name FROM user_profiles WHERE email LIKE '%superstar%' OR email LIKE '%edu%'
 SELECT text FROM tweets WHERE text LIKE '%intern%'
 SELECT name ,  email FROM user_profiles WHERE followers  >  1000
 SELECT name FROM user_profiles WHERE followers  >  (SELECT followers FROM user_profiles WHERE name  =  'Tyler Swift')
 SELECT T1.name ,  T1.email FROM user_profiles AS T1 JOIN follows AS T2 ON T1.uid  =  T2.f1 GROUP BY T2.f1 HAVING count(*)  >  1
 SELECT T1.name FROM user_profiles AS T1 JOIN tweets AS T2 ON T1.uid  =  T2.uid GROUP BY T2.uid HAVING count(*)  >  1
 SELECT T2.f1 FROM user_profiles AS T1 JOIN follows AS T2 ON T1.uid  =  T2.f2 WHERE T1.name  =  "Mary" INTERSECT SELECT T2.f1 FROM user_profiles AS T1 JOIN follows AS T2 ON T1.uid  =  T2.f2 WHERE T1.name  =  "Susan"
 SELECT T2.f1 FROM user_profiles AS T1 JOIN follows AS T2 ON T1.uid  =  T2.f2 WHERE T1.name  =  "Mary" OR T1.name  =  "Susan"
 SELECT name FROM user_profiles ORDER BY followers DESC LIMIT 1
 SELECT name ,  email FROM user_profiles ORDER BY followers LIMIT 1
 SELECT name ,  followers FROM user_profiles ORDER BY followers DESC
 SELECT name FROM user_profiles ORDER BY followers DESC LIMIT 5
 SELECT text FROM tweets ORDER BY createdate
 SELECT T1.name ,  count(*) FROM user_profiles AS T1 JOIN tweets AS T2 ON T1.uid  =  T2.uid GROUP BY T2.uid
 SELECT T1.name ,  T1.partitionid FROM user_profiles AS T1 JOIN tweets AS T2 ON T1.uid  =  T2.uid GROUP BY T2.uid HAVING count(*)  <  2
 SELECT T1.name ,  count(*) FROM user_profiles AS T1 JOIN tweets AS T2 ON T1.uid  =  T2.uid GROUP BY T2.uid HAVING count(*)  >  1
 SELECT avg(followers) FROM user_profiles WHERE UID NOT IN (SELECT UID FROM tweets)
 SELECT avg(followers) FROM user_profiles WHERE UID IN (SELECT UID FROM tweets)
 SELECT max(followers) ,  sum(followers) FROM user_profiles
 SELECT count(*) FROM Aircraft
 SELECT count(*) FROM Aircraft
 SELECT name ,  distance FROM Aircraft
 SELECT name ,  distance FROM Aircraft
 SELECT aid FROM Aircraft WHERE distance  >  1000
 SELECT aid FROM Aircraft WHERE distance  >  1000
 SELECT count(*) FROM Aircraft WHERE distance BETWEEN 1000 AND 5000
 SELECT count(*) FROM Aircraft WHERE distance BETWEEN 1000 AND 5000
 SELECT name ,  distance FROM Aircraft WHERE aid  =  12
 SELECT name ,  distance FROM Aircraft WHERE aid  =  12
 SELECT min(distance) ,  avg(distance) ,  max(distance) FROM Aircraft
 SELECT min(distance) ,  avg(distance) ,  max(distance) FROM Aircraft
 SELECT aid ,  name FROM Aircraft ORDER BY distance DESC LIMIT 1
 SELECT aid ,  name FROM Aircraft ORDER BY distance DESC LIMIT 1
 SELECT name FROM Aircraft ORDER BY distance LIMIT 3
 SELECT name FROM Aircraft ORDER BY distance LIMIT 3
 SELECT name FROM Aircraft WHERE distance  >  (SELECT avg(distance) FROM Aircraft)
 SELECT name FROM Aircraft WHERE distance  >  (SELECT avg(distance) FROM Aircraft)
 SELECT count(*) FROM Employee
 SELECT count(*) FROM Employee
 SELECT name ,  salary FROM Employee ORDER BY salary
 SELECT name ,  salary FROM Employee ORDER BY salary
 SELECT eid FROM Employee WHERE salary  >  100000
 SELECT eid FROM Employee WHERE salary  >  100000
 SELECT count(*) FROM Employee WHERE salary BETWEEN 100000 AND 200000
 SELECT count(*) FROM Employee WHERE salary BETWEEN 100000 AND 200000
 SELECT name ,  salary FROM Employee WHERE eid  =  242518965
 SELECT name ,  salary FROM Employee WHERE eid  =  242518965
 SELECT avg(salary) ,  max(salary) FROM Employee
 SELECT avg(salary) ,  max(salary) FROM Employee

 SELECT eid ,  name FROM Employee ORDER BY salary DESC LIMIT 1
 SELECT eid ,  name FROM Employee ORDER BY salary DESC LIMIT 1
 SELECT name FROM Employee ORDER BY salary ASC LIMIT 3
 SELECT name FROM Employee ORDER BY salary ASC LIMIT 3
 SELECT name FROM Employee WHERE salary  >  (SELECT avg(salary) FROM Employee)
 SELECT name FROM Employee WHERE salary  >  (SELECT avg(salary) FROM Employee)
 SELECT eid ,  salary FROM Employee WHERE name  =  'Mark Young'
 SELECT eid ,  salary FROM Employee WHERE name  =  "Mark Young"
 SELECT count(*) FROM Flight
 SELECT count(*) FROM Flight
 SELECT flno ,  origin ,  destination FROM Flight ORDER BY origin
 SELECT flno ,  origin ,  destination FROM Flight ORDER BY origin
 SELECT flno FROM Flight WHERE origin  =  "Los Angeles"
 SELECT flno FROM Flight WHERE origin  =  "Los Angeles"
 SELECT origin FROM Flight WHERE destination  =  "Honolulu"
 SELECT origin FROM Flight WHERE destination  =  "Honolulu"
 SELECT departure_date ,  arrival_date FROM Flight WHERE origin  =  "Los Angeles" AND destination  =  "Honolulu"
 SELECT departure_date ,  arrival_date FROM Flight WHERE origin  =  "Los Angeles" AND destination  =  "Honolulu"
 SELECT flno FROM Flight WHERE distance  >  2000
 SELECT flno FROM Flight WHERE distance  >  2000
 SELECT avg(price) FROM Flight WHERE origin  =  "Los Angeles" AND destination  =  "Honolulu"
 SELECT avg(price) FROM Flight WHERE origin  =  "Los Angeles" AND destination  =  "Honolulu"
 SELECT origin ,  destination FROM Flight WHERE price  >  300
 SELECT origin ,  destination FROM Flight WHERE price  >  300
 SELECT flno ,  distance FROM Flight ORDER BY price DESC LIMIT 1
 SELECT flno ,  distance FROM Flight ORDER BY price DESC LIMIT 1
 SELECT flno FROM Flight ORDER BY distance ASC LIMIT 3
 SELECT flno FROM Flight ORDER BY distance ASC LIMIT 3
 SELECT avg(distance) ,  avg(price) FROM Flight WHERE origin  =  "Los Angeles"
 SELECT avg(distance) ,  avg(price) FROM Flight WHERE origin  =  "Los Angeles"
 SELECT origin ,  count(*) FROM Flight GROUP BY origin
 SELECT origin ,  count(*) FROM Flight GROUP BY origin
 SELECT destination ,  count(*) FROM Flight GROUP BY destination
 SELECT destination ,  count(*) FROM Flight GROUP BY destination
 SELECT origin FROM Flight GROUP BY origin ORDER BY count(*) DESC LIMIT 1
 SELECT origin FROM Flight GROUP BY origin ORDER BY count(*) DESC LIMIT 1
 SELECT destination FROM Flight GROUP BY destination ORDER BY count(*) LIMIT 1
 SELECT destination FROM Flight GROUP BY destination ORDER BY count(*) LIMIT 1
 SELECT T2.name FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T1.flno  =  99
 SELECT T2.name FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T1.flno  =  99
 SELECT T1.flno FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T2.name  =  "Airbus A340-300"
 SELECT T1.flno FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T2.name  =  "Airbus A340-300"
 SELECT T2.name ,  count(*) FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid GROUP BY T1.aid
 SELECT T2.name ,  count(*) FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid GROUP BY T1.aid
 SELECT T2.name FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid GROUP BY T1.aid HAVING count(*)  >= 2
 SELECT T2.name FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid GROUP BY T1.aid HAVING count(*)  >= 2
 SELECT count(DISTINCT eid) FROM Certificate
 SELECT count(DISTINCT eid) FROM Certificate
 SELECT eid FROM Employee EXCEPT SELECT eid FROM Certificate
 SELECT eid FROM Employee EXCEPT SELECT eid FROM Certificate
 SELECT T3.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T1.name  =  "John Williams"
 SELECT T3.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T1.name  =  "John Williams"
 SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.name  =  "Boeing 737-800"
 SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.name  =  "Boeing 737-800"
 SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.name  =  "Boeing 737-800" INTERSECT SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.name  =  "Airbus A340-300"
 SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.name  =  "Boeing 737-800" INTERSECT SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.name  =  "Airbus A340-300"
 SELECT name FROM Employee EXCEPT SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.name  =  "Boeing 737-800"
 SELECT name FROM Employee EXCEPT SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.name  =  "Boeing 737-800"
 SELECT T2.name FROM Certificate AS T1 JOIN Aircraft AS T2 ON T2.aid  =  T1.aid GROUP BY T1.aid ORDER BY count(*) DESC LIMIT 1
 SELECT T2.name FROM Certificate AS T1 JOIN Aircraft AS T2 ON T2.aid  =  T1.aid GROUP BY T1.aid ORDER BY count(*) DESC LIMIT 1
 SELECT T2.name FROM Certificate AS T1 JOIN Aircraft AS T2 ON T2.aid  =  T1.aid WHERE T2.distance  >  5000 GROUP BY T1.aid ORDER BY count(*)  >=  5
 SELECT T2.name FROM Certificate AS T1 JOIN Aircraft AS T2 ON T2.aid  =  T1.aid WHERE T2.distance  >  5000 GROUP BY T1.aid ORDER BY count(*)  >=  5
 SELECT T1.name ,  T1.salary FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid GROUP BY T1.eid ORDER BY count(*) DESC LIMIT 1
 SELECT T1.name ,  T1.salary FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid GROUP BY T1.eid ORDER BY count(*) DESC LIMIT 1
 SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.distance  >  5000 GROUP BY T1.eid ORDER BY count(*) DESC LIMIT 1
 SELECT T1.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T3.distance  >  5000 GROUP BY T1.eid ORDER BY count(*) DESC LIMIT 1
 SELECT count(*) FROM Allergy_type
 SELECT count(DISTINCT allergy) FROM Allergy_type
 SELECT count(DISTINCT allergytype) FROM Allergy_type
 SELECT count(DISTINCT allergytype) FROM Allergy_type
 SELECT DISTINCT allergytype FROM Allergy_type
 SELECT DISTINCT allergytype FROM Allergy_type
 SELECT allergy ,  allergytype FROM Allergy_type
 SELECT allergy ,  allergytype FROM Allergy_type
 SELECT DISTINCT allergy FROM Allergy_type WHERE allergytype  =  "food"
 SELECT DISTINCT allergy FROM Allergy_type WHERE allergytype  =  "food"
 SELECT allergytype FROM Allergy_type WHERE allergy  =  "Cat"
 SELECT allergytype FROM Allergy_type WHERE allergy  =  "Cat"
 SELECT count(DISTINCT allergy) FROM Allergy_type WHERE allergytype  =  "animal"
 SELECT count(*) FROM Allergy_type WHERE allergytype  =  "animal"
 SELECT allergytype ,  count(*) FROM Allergy_type GROUP BY allergytype
 SELECT allergytype ,  count(*) FROM Allergy_type GROUP BY allergytype
 SELECT allergytype FROM Allergy_type GROUP BY allergytype ORDER BY count(*) DESC LIMIT 1
 SELECT allergytype FROM Allergy_type GROUP BY allergytype ORDER BY count(*) DESC LIMIT 1
 SELECT allergytype FROM Allergy_type GROUP BY allergytype ORDER BY count(*) ASC LIMIT 1
 SELECT allergytype FROM Allergy_type GROUP BY allergytype ORDER BY count(*) ASC LIMIT 1
 SELECT count(*) FROM Student
 SELECT count(*) FROM Student
 SELECT Fname ,  Lname FROM Student
 SELECT Fname ,  Lname FROM Student
 SELECT count(DISTINCT advisor) FROM Student
 SELECT count(DISTINCT advisor) FROM Student
 SELECT DISTINCT Major FROM Student
 SELECT DISTINCT Major FROM Student
 SELECT DISTINCT city_code FROM Student
 SELECT DISTINCT city_code FROM Student

In [282]:
df2_is_350['correct'] = np.where(df2_is_350['open_ai_completion'].str
                                                         .strip()
                                                         .str
                                                         .lower()
                                                         .apply(lambda x: re.sub('\s+', '',x)) == 
                             df2_is_350['model_response'].str
                                                     .strip()
                                                     .str
                                                     .lower()
                                                     .apply(lambda x: re.sub('\s+', '',x)), 1, 0)

In [283]:
df2_is_350['correct'].mean()

0.9628571428571429

In [325]:
df2_is_350['open_ai_completion'].str.len().max()

322

In [297]:
df2_is_350['model_response'].str.len().max()

321

## Test out of sample

In [285]:
df2_oos_350 = df2[df2['train_test'] == 'test'][['question', 'db_id', 'query']].head(350)

df2_oos_350['schema']         = df2_oos_350.apply(lambda x: get_schema(x['db_id']), axis=1)
df2_oos_350['schema']         = df2_oos_350['schema'].apply(splitter)
df2_oos_350['open_ai_prompt'] = df2_oos_350.apply(lambda x: short_open_ai_prompt(x), axis=1)
df2_oos_350['open_ai_completion'] = df2_oos_350.apply(lambda x: open_ai_completion(x), axis=1)

In [299]:
df2_oos_350["model_response"] = ""    
df2_oos_350["model_response"] = df2_oos_350.apply(call_model_350, axis=1)

 SELECT COUNT(*) FROM head WHERE age  >  56
 SELECT T1.Name ,  T1.born_state ,  T1.age FROM head AS T1 JOIN department AS T2 ON T1.head_ID  =  T2.head_ID ORDER BY T1.age
 SELECT Creation ,  Name ,  Budget_in_Billions FROM department
 SELECT max(Budget_in_Billions) ,  min(Budget_in_Billions) FROM department
 SELECT avg(Num_Employees) FROM department WHERE Ranking BETWEEN 10 AND 15
 SELECT name FROM head WHERE born_state != "CA"
 SELECT DISTINCT Creation FROM department WHERE born_state  =  "Alabama"
 SELECT name FROM head GROUP BY born_state HAVING count(*)  >=  3
 SELECT YEAR(Creation) FROM department GROUP BY YEAR(Creation) ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T2.Name ,  Num_Employees FROM department AS T1 JOIN management AS T2 ON T1.head_ID  =  T2.head_ID WHERE T1.temporary_acting  =  "Yes"
 SELECT count(*) FROM management WHERE temporary_acting != ''
 SELECT count(*) FROM head WHERE head_ID NOT IN (SELECT head_ID FROM management)
 SELECT DISTINCT age FROM management WHERE temporary_acting
 SELECT T1.name FROM department AS T1 JOIN head AS T2 ON T1.Department_ID  =  T2.head_ID JOIN management AS T3 ON T2.Department_ID  =  T3.department_ID WHERE T3.head_ID  =  T2.head_ID GROUP BY T2.head_ID ORDER BY T2.head_ID
 SELECT T2.Name ,  T2.Creation ,  COUNT(*) FROM head AS T1 JOIN management AS T2 ON T1.head_ID  =  T2.head_ID GROUP BY T1.head_ID HAVING COUNT(*)  >  1
 SELECT head_ID ,  name FROM head WHERE name LIKE "Ha%"
 SELECT count(*) FROM farm
 SELECT count(*) FROM farm
 SELECT count(*) FROM farm ORDER BY Total_Horses DESC
 SELECT T2.`Total_Horses` FROM farm AS T1 JOIN competition_record AS T2 ON T1.`Farm_ID`  =  T2.`Farm_ID` ORDER BY T2.`Farm_ID`
 SELECT Hosts FROM farm_competition WHERE Theme != "Aliens"
 SELECT Hosts FROM competition_record WHERE Theme != "Aliens"
 SELECT Theme FROM farm_competition ORDER BY Year ASC
 SELECT Theme FROM farm_competition ORDER BY Year ASC
 SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000
 SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  50000
 SELECT max(Cows) ,  min(Cows) FROM farm
 SELECT max(`Total_Cows`) ,  min(`Total_Cows`) FROM farm
 SELECT count(DISTINCT Status) FROM city
 SELECT count(DISTINCT Status) FROM city
 SELECT Official_Name FROM city ORDER BY Population DESC
 SELECT Official_Name FROM city ORDER BY Population DESC
 SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1
 SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1
 SELECT T1.Year ,  T1.Official_Name FROM city AS T1 Host_city_ID
 SELECT T1.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID
 SELECT Official_Name FROM city WHERE Host_city_ID  >  1
 SELECT Official_Name FROM city WHERE Number_of_hostings  >  1
 SELECT T1.Status FROM city AS T1 JOIN competition_record AS T2 ON T1.City_ID  =  T2.Host_city_ID ORDER BY count(*) DESC LIMIT 1
 SELECT T1.Status FROM city AS T1 JOIN competition_record AS T2 ON T1.City_ID  =  T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1
 SELECT Theme FROM competition_record WHERE Host_city_ID  >  1000
 SELECT Theme FROM competition_record WHERE Host_city_ID  >  1000
 SELECT DISTINCT Status ,  avg(Population) FROM city
 SELECT T1.Status ,  T1.Population  FROM city AS T1 JOIN city AS T2 ON T1.City_ID  =  T2.City_ID GROUP BY T2.City_ID
 SELECT DISTINCT Status ,  Count(*) FROM city GROUP BY Status
 SELECT DISTINCT Status FROM city ORDER BY Frequency DESC
 SELECT Status FROM city GROUP BY Status ORDER BY Count(*) DESC LIMIT 1
 SELECT Most_Common_Status FROM city
 SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Competition_ID FROM farm_competition)
 SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Farm_ID FROM farm_competition)
 SELECT Status FROM city WHERE Population  >  1500 AND Population  <  500
 SELECT DISTINCT Status FROM city WHERE Population  >  1500 AND Population  <  500
 SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500
 SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500
 SELECT City_ID ,  Census_Ranking FROM city WHERE Status != "Village"
 SELECT City_ID ,  Census_Ranking FROM city WHERE Status != "Village"
 SELECT count(*) FROM book
 SELECT Writer FROM book ORDER BY Title ASC
 SELECT Title FROM book ORDER BY Issues ASC
 SELECT Title FROM book WHERE Writer != "Elaine Lee"
 SELECT Title ,  Issues FROM book
 SELECT Publication_Date FROM publication ORDER BY Price DESC
 SELECT DISTINCT Publisher FROM publication WHERE Price  >  5000000
 SELECT Publisher FROM publication ORDER BY Price DESC LIMIT 1
 SELECT Publication_Date FROM publication ORDER BY Price ASC LIMIT 3
 SELECT Title ,  Publication_Date FROM book
 SELECT Writer FROM book WHERE Price  >  4000000
 SELECT Title FROM book ORDER BY Price DESC
 SELECT Publisher FROM publication GROUP BY Publisher HAVING COUNT(*)  >  1
 SELECT DISTINCT Publisher ,  count(*) FROM publication GROUP BY Publisher
 SELECT Publication_Date FROM publication GROUP BY Publication_Date ORDER BY COUNT(*) DESC LIMIT 1
 SELECT Writer FROM book GROUP BY Writer HAVING COUNT(*)  >  1
 SELECT Title FROM book WHERE Book_ID NOT IN (SELECT Publication_ID FROM publication)
 SELECT DISTINCT Publisher FROM publication WHERE Price  >  100000000 INTERSECT SELECT DISTINCT Publisher FROM publication WHERE Price  <  5000000
 SELECT count(DISTINCT Publication_Date) FROM publication
 SELECT count(DISTINCT Publication_Date) FROM publication
 SELECT Price FROM publication WHERE Publisher  =  "Person" OR Publisher  =  "Wiley"
 SELECT T1.`catalog_entry_name` FROM Catalog_Contents AS T1 JOIN Catalog_Contents_Additional_Attributes AS T2 ON T1.`catalog_entry_id` = T2.`catalog_entry_id` WHERE T2.`attribute_id` = 2
 SELECT DISTINCT catalog_entry_name FROM Catalog_Contents
 SELECT attribute_name FROM Attribute_Definitions GROUP BY attribute_name HAVING COUNT(*)  >  3
 SELECT attribute_data_type FROM Attribute_Definitions GROUP BY attribute_data_type HAVING COUNT(*)  >  3
 SELECT attribute_data_type FROM Attribute_Definitions WHERE attribute_name  =  "Green"
 SELECT attribute_data_type FROM Attribute_Definitions WHERE attribute_name  =  "Green"
 SELECT catalog_level_name ,  catalog_level_number FROM Catalog_Structure WHERE catalog_level_number BETWEEN 5 AND 10
 SELECT T2.name ,  T2.level FROM Catalog_Structure AS T1 JOIN Catalog_Level_Number AS T2 ON T1.catalog_id  =  T2.catalog_id WHERE T2.level_number  BETWEEN 5 AND 10
 SELECT DISTINCT catalog_publisher FROM Catalogs WHERE catalog_publisher LIKE "%%Murray%"
 SELECT DISTINCT T1.name FROM Catalog_publisher AS T1 JOIN Catalogs AS T2 ON T1.publisher_id  =  T2.id WHERE T2.name  LIKE "%Murray%"
 SELECT publisher FROM Catalogs GROUP BY publisher ORDER BY count(*) DESC LIMIT 1
 SELECT catalog_publisher FROM Catalogs ORDER BY count(*) DESC LIMIT 1
 SELECT T1.name ,  T1.date_of_publication FROM Catalogs AS T1 JOIN Catalog_Structure AS T2 ON T1.catalog_id  =  T2.catalog_id GROUP BY T2.catalog_level_number HAVING T2.catalog_level_number  >  5
 SELECT T1.name ,  T1.date_of_publication FROM Catalogs AS T1 JOIN Catalog_Structure AS T2 ON T1.catalog_id  =  T2.catalog_id GROUP BY T2.catalog_level_number HAVING T2.catalog_level_number  >  5
 SELECT T1.`catalog_entry_name` FROM `Catalog_Contents` AS T1 JOIN `Catalog_Contents_Additional_Attributes` AS T2 ON T1.`catalog_entry_id` = T2.`catalog_entry_id` GROUP BY T2.`attribute_id` HAVING COUNT(*)  >  (SELECT count(*) FROM `Catalog_Contents` AS T1 JOIN `Catalog_Contents_Additional_Attributes` AS T2 ON T1.`catalog_entry_id` = T2.`catalog_entry_id` WHERE T1.`catalog_entry_name` =  "Bicycle")
 SELECT T1.name FROM Catalog_Contents AS T1 JOIN Attribute_Definitions AS T2 ON T1.parent_entry_id  =  T2.attribute_id GROUP BY T2.attribute_id ORDER BY count(*) DESC LIMIT 1
 SELECT T2.`catalog_entry_name` FROM Catalog_Contents AS T1 JOIN Catalog_Contents_Additional_Attributes AS T2 ON T1.`catalog_entry_id` = T2.`catalog_entry_id` GROUP BY T1.`catalog_entry_id` ORDER BY T2.`attribute_value` DESC LIMIT 1
 SELECT T1.name FROM Catalog_Contents AS T1 JOIN Catalog_Contents_Additional_Attributes AS T2 ON T1.catalog_entry_id  =  T2.catalog_entry_id GROUP BY T2.attribute_id ORDER BY T2.attribute_value DESC LIMIT 1

 SELECT T2.level_name FROM Catalog_Contents AS T1 JOIN Catalog_Contents_Additional_Attributes AS T2 ON T1.parent_entry_id = T2.catalog_entry_id GROUP BY T1.parent_entry_id ORDER BY T1.price_in_dollars DESC LIMIT 1
 SELECT T2.level_name FROM Catalog_Contents AS T1 JOIN Catalog_Contents_Additional_Attributes AS T2 ON T1.catalog_entry_id  =  T2.catalog_entry_id GROUP BY T1.catalog_entry_id ORDER BY T1.price_in_dollars DESC LIMIT 1
 SELECT avg(price_in_euros) ,  min(price_in_euros) FROM Products
 SELECT avg(price_in_euros) ,  min(price_in_euros) FROM Catalog_Contents
 SELECT product_stock_number FROM Catalog_Contents WHERE height  =  MAX(height)
 SELECT T1.catalog_entry_name FROM Catalog_Contents AS T1 JOIN Catalog_Contents_Additional_Attributes AS T2 ON T1.catalog_entry_id  =  T2.catalog_entry_id GROUP BY T2.catalog_entry_id ORDER BY T2.catalog_entry_id DESC LIMIT 1
 SELECT product_name FROM Catalog_Contents WHERE capacity  =  smallest(capacity)
 SELECT catalog_entry_name FROM Catalog_Contents WHERE capacity  =  1
 SELECT product_name FROM Catalog_Contents WHERE product_stock_number LIKE "2%"
 SELECT catalog_entry_name FROM Catalog_Contents WHERE product_stock_number LIKE "2%"
 SELECT T1.name FROM Catalog_Contents AS T1 JOIN Catalog_Structure AS T2 ON T1.catalog_level_number  =  T2.catalog_id WHERE T2.catalog_level_number  =  8
 SELECT T2.name FROM Catalog_Contents AS T1 JOIN Catalog_Structure AS T2 ON T1.catalog_level_number  =  T2.catalog_id WHERE T2.catalog_level_number  =  8
 SELECT product_name FROM Catalog_Contents WHERE length  <  3 OR height  >  5
 SELECT T2.name FROM Catalog_Contents AS T1 JOIN Catalog_Contents_Additional_Attributes AS T2 ON T1.id  =  T2.catalog_entry_id WHERE T2.attribute_value  =  "length" AND T1.length  <  3 OR T1.length  >  5
 SELECT attribute_name ,  attribute_id FROM Attribute_Definitions WHERE attribute_value = 0
 SELECT attribute_name ,  attribute_id FROM Attribute_Definitions WHERE attribute_value = 0
 SELECT product_name ,  capacity FROM Catalog_Contents WHERE price_in_dollars  >  700
 SELECT T1.catalog_entry_name ,  T1.capacity FROM Catalog_Contents AS T1 JOIN Catalog_Contents_Additional_Attributes AS T2 ON T1.catalog_entry_id  =  T2.catalog_entry_id WHERE T2.attribute_value  >  700
 SELECT date_of_latest_revision FROM Catalog_Revisions
 SELECT DATE_FORMAT(date_of_latest_revision, "%Y/%m/%d") AS Date , COUNT(*) FROM Catalogs GROUP BY DATE_FORMAT(date_of_latest_revision, "%Y/%m/%d")
 SELECT count(*) FROM Catalog_Contents
 SELECT count(*) FROM Catalog_Contents
 SELECT product_stock_number FROM Catalog_Contents WHERE next_entry_id > 8
 SELECT catalog_entry_name FROM Catalog_Contents WHERE next_entry_id  >  8
 SELECT count(*) FROM editor
 SELECT Name FROM editor ORDER BY Age ASC
 SELECT Name ,  Age FROM editor
 SELECT Name FROM editor WHERE Age  >  25
 SELECT Name FROM editor WHERE Age  =  24 OR Age  =  25
 SELECT Name FROM editor ORDER BY Age DESC LIMIT 1
 SELECT DISTINCT Age ,  COUNT(*) FROM editor GROUP BY Age
 SELECT Age FROM editor GROUP BY Age ORDER BY COUNT(*) DESC LIMIT 1
 SELECT DISTINCT Theme FROM journal
 SELECT T1.Name ,  T2.Theme FROM editor AS T1 JOIN journal_committee AS T2 ON T1.Editor_ID  =  T2.Editor_ID JOIN journal AS T3 ON T2.Journal_ID  =  T3.Journal_ID WHERE T3.Theme  =  "Computer Science"
 SELECT T1.Name ,  T2.Theme FROM journal_committee AS T1 JOIN editor AS T2 ON T1.Editor_ID  =  T2.ID
 SELECT T1.Name ,  T1.Age ,  T2.Theme FROM editor AS T1 JOIN journal_committee AS T2 ON T1.Editor_ID  =  T2.Editor_ID ORDER BY T2.Theme
 SELECT T1.Name FROM editor AS T1 JOIN journal_committee AS T2 ON T1.Editor_ID  =  T2.Editor_ID WHERE T2.Sales  >  3000
 SELECT T1.Editor_ID ,  T1.Name ,  COUNT(*) FROM editor AS T1 JOIN journal_committee AS T2 ON T1.Editor_ID  =  T2.Editor_ID GROUP BY T1.Editor_ID
 SELECT T1.Name FROM editor AS T1 JOIN journal_committee AS T2 ON T1.Editor_ID  =  T2.Editor_ID GROUP BY T1.Editor_ID HAVING count(*)  >=  2
 SELECT Name FROM editor WHERE NOT (SELECT Name FROM journal_committee)
 SELECT Date ,  Theme ,  Sales FROM journal WHERE Editor_ID NOT IN (SELECT Editor_ID FROM journal_committee)
 SELECT avg(Sales) FROM journal WHERE Editor_ID  =  (SELECT Editor_ID FROM journal_committee WHERE Journal_ID  =  (SELECT Journal_ID FROM journal_committee WHERE Work_Type  =  "Photo"))
 SELECT count(*) FROM Accounts
 SELECT count(*) FROM Accounts
 SELECT account_id ,  customer_id , account_name FROM Accounts
 SELECT account_id ,  customer_id ,  account_name FROM Accounts
 SELECT other_account_details FROM Accounts WHERE account_name  =  "338"
 SELECT other_account_details FROM Accounts WHERE account_name  =  "338"
 SELECT customer_first_name ,  customer_last_name ,  customer_phone FROM Customers WHERE account_name  =  "162"
 SELECT T1.customer_first_name ,  T1.customer_last_name ,  T1.customer_phone FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id WHERE T1.account_name = "162"
 SELECT count(*) FROM Accounts WHERE customer_first_name  =  "Art" AND customer_last_name  =  "Turcotte"
 SELECT count(*) FROM Customers AS T1 JOIN Customers_Cards AS T2 ON T1.customer_id = T2.customer_id WHERE T1.customer_first_name = "Art" AND T1.customer_last_name = "Turcotte"
 SELECT T1.customer_id ,  count(*) FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id
 SELECT T1.customer_id ,  count(*) FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id
 SELECT T1.customer_id ,  count(*) FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.customer_id ,  count(*) FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id ORDER BY count(*) DESC LIMIT 1
 SELECT customer_first_name ,  customer_last_name ,  customer_id FROM Customers ORDER BY count(*) DESC LIMIT 1
 SELECT T1.customer_first_name ,  T1.customer_last_name ,  T1.customer_id FROM customers AS T1 JOIN accounts AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id ORDER BY count(*) DESC LIMIT 1
 SELECT count(*) FROM Customers
 SELECT count(*) FROM Customers
 SELECT customer_first_name ,  customer_last_name FROM Customers
 SELECT customer_first_name ,  customer_last_name FROM Customers WHERE customer_id NOT IN (SELECT account_id FROM Accounts)
 SELECT DISTINCT customer_first_name ,  customer_last_name FROM Customers
 SELECT T1.customer_first_name ,  T1.customer_last_name FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id
 SELECT count(*) FROM Accounts
 SELECT count(*) FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id
 SELECT count(*) FROM Customers
 SELECT count(*) FROM Customers
 SELECT customer_id ,  customer_first_name ,  customer_last_name ,  customer_phone FROM Customers
 SELECT customer_id ,  account_name ,  customer_phone FROM Customers
 SELECT customer_phone ,  customer_email FROM Customers WHERE customer_first_name  =  "Aniyah" AND customer_last_name  =  "Feest"
 SELECT customer_first_name ,  customer_email FROM Customers WHERE customer_first_name  =  "Aniyah" AND customer_last_name  =  "Feest"
 SELECT count(*) FROM Customers_Cards
 SELECT count(*) FROM Customers_Cards
 SELECT card_id ,  customer_id ,  card_type_code ,  card_number FROM Customers_Cards
 SELECT T2.card_id ,  T2.customer_id ,  T2.card_type_code ,  T2.card_number FROM customers_cards AS T1 JOIN cards AS T2 ON T1.card_id = T2.card_id
 SELECT date_valid_from ,  date_valid_to FROM Customers_Cards WHERE card_number  =  "4560596484842"
 SELECT date_valid_from ,  date_valid_to FROM Customers_Cards WHERE card_number  =  4560596484842
 SELECT customer_first_name ,  customer_last_name ,  customer_phone FROM Customers_Cards WHERE card_id  =  4560596484842
 SELECT T1.customer_first_name ,  T1.customer_last_name ,  T1.customer_phone FROM customers AS T1 JOIN customers_cards AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.card_number  =  4560596484842
 SELECT count(*) FROM Customers_Cards WHERE customer_id =  "Art Turcotte"
 SELECT count(*) FROM Customers AS T1 JOIN Customers_Cards AS T2 ON T1.customer_id = T2.customer_id WHERE T1.customer_first_name = "Art" AND T1.customer_last_name = "Turcotte"

 SELECT count(*) FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id WHERE T1.account_name LIKE "Debit%"
 SELECT count(DISTINCT card_type_code) FROM Customers_Cards WHERE card_type_code LIKE "Debit%"
 SELECT count(*) FROM Customers_Cards WHERE customer_id =  "Blanche Huels"
 SELECT count(*) FROM Customers AS T1 JOIN Customers_Cards AS T2 ON T1.customer_id = T2.customer_id WHERE T1.customer_first_name = "Blanche" AND T1.customer_last_name = "Huels"
 SELECT T1.customer_id ,  count(*) FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id
 SELECT DISTINCT customer_id ,  count(*) FROM Customers_Cards GROUP BY customer_id
 SELECT customer_id ,  count(*) FROM Customers_Cards GROUP BY customer_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.customer_id ,  count(*) FROM customers AS T1 JOIN customers_cards AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id ORDER BY count(*) DESC LIMIT 1
 SELECT T1.customer_id ,  T1.customer_first_name ,  T1.customer_last_name FROM customers AS T1 JOIN customers_cards AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id HAVING count(*)  >=  2
 SELECT T1.customer_id ,  T1.customer_first_name ,  T1.customer_last_name FROM customers AS T1 JOIN customers_cards AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id HAVING count(*)  >=  2
 SELECT customer_id ,  customer_first_name ,  customer_last_name FROM Customers ORDER BY count(*) DESC LIMIT 1
 SELECT customer_id ,  fullname FROM Customers ORDER BY count(*) DESC LIMIT 1
 SELECT card_type_code ,  count(*) FROM Customers_Cards GROUP BY card_type_code
 SELECT DISTINCT card_type_code ,  count(*) FROM Customers_Cards GROUP BY card_type_code
 SELECT card_type_code FROM Cards GROUP BY card_type_code ORDER BY count(*) DESC LIMIT 1
 SELECT card_type_code FROM Customers_Cards GROUP BY card_type_code ORDER BY count(*) DESC LIMIT 1
 SELECT card_type_code FROM Customers_Cards GROUP BY card_type_code HAVING COUNT(*)  >=  5
 SELECT card_type_code FROM Cards GROUP BY card_type_code HAVING COUNT(*)  >=  5
 SELECT card_type_code ,  count(*) FROM Customers_Cards GROUP BY card_type_code
 SELECT DISTINCT card_type_code ,  count(*) FROM Customers_Cards GROUP BY card_type_code
 SELECT customer_id ,  customer_first_name FROM Customers
 SELECT customer_id ,  customer_first_name FROM Customers WHERE NOT EXISTS (SELECT * FROM Customers_Cards WHERE customer_id =  account_id )
 SELECT card_type_code FROM Customers_Cards
 SELECT DISTINCT card_type_code FROM Customers_Cards
 SELECT count(*) FROM cards
 SELECT count(DISTINCT card_type_code) FROM Accounts
 SELECT type_code FROM financial_transactions
 SELECT DISTINCT transaction_type FROM Financial_Transactions
 SELECT count(*) FROM Financial_Transactions
 SELECT count(DISTINCT transaction_type) FROM Financial_Transactions
 SELECT avg(transaction_amount) ,  sum(transaction_amount) FROM Financial_Transactions
 SELECT avg(transaction_amount) ,  sum(transaction_amount) FROM Financial_Transactions
 SELECT card_type_code ,  count(*) FROM Financial_Transactions GROUP BY card_type_code
 SELECT DISTINCT T1.card_type_code ,  count(*) FROM transactions AS T1 JOIN Customers_Cards AS T2 ON T1.card_id = T2.card_id GROUP BY T1.card_type_code
 SELECT transaction_type ,  count(*) FROM Financial_Transactions GROUP BY transaction_type
 SELECT DISTINCT T1.transaction_type ,  COUNT(*) FROM transactions AS T1 JOIN financial_transactions AS T2 ON T1.account_id = T2.account_id GROUP BY T1.account_id
 SELECT TRANSACTION_TYPE FROM Financial_Transactions GROUP BY TRANSACTION_TYPE ORDER BY SUM(transaction_amount) DESC LIMIT 1
 SELECT transaction_type FROM Financial_Transactions ORDER BY transaction_amount DESC LIMIT 1
 SELECT account_id ,  count(*) FROM Financial_Transactions GROUP BY account_id
 SELECT T2.account_id ,  count(*) FROM Accounts AS T1 JOIN Financial_Transactions AS T2 ON T1.account_id = T2.account_id GROUP BY T1.account_id
 SELECT T1.Customer_Phone FROM Customers AS T1 JOIN Customers_Policies AS T2 ON T1.Customer_ID  =  T2.Customer_ID
 SELECT T1.Customer_Phone FROM Customers AS T1 JOIN Customers_Policies AS T2 ON T1.Customer_ID  =  T2.Customer_ID
 SELECT T2.Customer_Phone FROM Customers AS T1 JOIN Available_Policies AS T2 ON T1.Customer_ID  =  T2.Customer_ID WHERE T2.policy_type_code  =  "Life Insurance"
 SELECT T2.Customer_Phone FROM Customers AS T1 JOIN Available_Policies AS T2 ON T1.Customer_ID  =  T2.Customer_ID WHERE T2.policy_type_code  =  "Life Insurance"
 SELECT type_code FROM Available_Policies GROUP BY type_code ORDER BY count(*) DESC LIMIT 1
 SELECT policy_type_code FROM Available_Policies GROUP BY policy_type_code ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.Customer_Phone FROM Customers AS T1 JOIN Services AS T2 ON T1.Customer_ID  =  T2.Customer_ID JOIN Available_Policies AS T3 ON T2.Service_ID  =  T3.Service_ID WHERE T3.policy_type_code  =  "home" GROUP BY T1.Customer_ID ORDER BY COUNT(*) DESC LIMIT 1
 SELECT T1.Customer_Phone FROM Customers AS T1 JOIN Available_Policies AS T2 ON T1.Customer_ID  =  T2.Customer_ID GROUP BY T2.policy_type_code ORDER BY COUNT(*) DESC LIMIT 1
 SELECT policy_type_code FROM Available_Policies GROUP BY policy_type_code HAVING COUNT(*)  >  4
 SELECT T2.type_code FROM Policies AS T1 JOIN Customers AS T2 ON T1.Policy_ID  =  T2.Customer_ID GROUP BY T1.Policy_ID HAVING count(*)  >  4
 SELECT sum(Settlement_Amount) ,  avg(Settlement_Amount) FROM Settlements
 SELECT sum(Settlement_Amount) ,  avg(Settlement_Amount) FROM Settlements
 SELECT Service_name FROM Services WHERE Service_ID IN (SELECT Service_ID FROM First_Notification_of_Loss GROUP BY Service_ID HAVING count(*)  >  2)
 SELECT T2.Service_name FROM Services AS T1 JOIN First_Notification_of_Loss AS T2 ON T1.Service_ID  =  T2.Service_ID GROUP BY T1.Service_ID HAVING count(*)  >  2
 SELECT Effective_Date FROM Claims ORDER BY SUM(Settlement_Amount) DESC LIMIT 1
 SELECT Effective_Date FROM Claims ORDER BY Settlement_Amount DESC LIMIT 1
 SELECT count(*) FROM Available_Policies WHERE Customer_name  =  "Dayana Robel"
 SELECT count(*) FROM Available_Policies WHERE customer_name  =  "Dayana Robel"
 SELECT T1.Customer_name FROM Customers AS T1 JOIN Customers_Policies AS T2 ON T1.Customer_ID  =  T2.Customer_ID GROUP BY T1.Customer_ID ORDER BY COUNT(*) DESC LIMIT 1
 SELECT Customer_name FROM Customers GROUP BY Customer_name ORDER BY count(*) DESC LIMIT 1
 SELECT policy_type_code FROM Available_Policies WHERE Customer_name  =  "Dayana Robel"

In [301]:
df2_oos_350['model_response']

0             SELECT COUNT(*) FROM head WHERE age  >  56
1       SELECT T1.Name ,  T1.born_state ,  T1.age FRO...
2       SELECT Creation ,  Name ,  Budget_in_Billions...
3       SELECT max(Budget_in_Billions) ,  min(Budget_...
4       SELECT avg(Num_Employees) FROM department WHE...
                             ...
907     SELECT count(*) FROM Available_Policies WHERE...
908     SELECT count(*) FROM Available_Policies WHERE...
909     SELECT T1.Customer_name FROM Customers AS T1 ...
910     SELECT Customer_name FROM Customers GROUP BY ...
911     SELECT policy_type_code FROM Available_Polici...
Name: model_response, Length: 350, dtype: object

In [303]:
def regex(x):
    try: return re.sub('\s+', '', x)
    except: return None

In [304]:
df2_oos_350['correct'] = np.where(df2_oos_350['open_ai_completion'].str
                                                         .strip()
                                                         .str
                                                         .lower()
                                                         .apply(lambda x: re.sub('\s+', '',x)) == 
                             df2_oos_350['model_response'].str
                                                     .strip()
                                                     .str
                                                     .lower()
                                                     .apply(lambda x: regex(x)), 1, 0)

In [306]:
df2_oos_350['correct'].mean()

0.22857142857142856

In [313]:
print(df2_oos_350[df2_oos_350['correct'] == 0].iloc[0]['open_ai_prompt'])
print(df2_oos_350[df2_oos_350['correct'] == 0].iloc[0]['open_ai_completion'])
print(df2_oos_350[df2_oos_350['correct'] == 0].iloc[0]['model_response'])

Schema: CREATE TABLE "department" ("Department_ID" int,"Name" text,"Creation" text,"Ranking" int,"Budget_in_Billions" real,"Num_Employees" real,PRIMARY KEY ("Department_ID"));CREATE TABLE "head" ("head_ID" int,"name" text,"born_state" text,"age" real,PRIMARY KEY ("head_ID"));CREATE TABLE "management" ("department_ID" int,"head_ID" int,"temporary_acting" text,PRIMARY KEY ("Department_ID","head_ID"),FOREIGN KEY ("Department_ID") REFERENCES `department`("Department_ID"),FOREIGN KEY ("head_ID") REFERENCES `head`("head_ID"))
Question: List the name, born state and age of the heads of departments ordered by age.

###


 SELECT name ,  born_state ,  age FROM head ORDER BY age

 SELECT T1.Name ,  T1.born_state ,  T1.age FROM head AS T1 JOIN department AS T2 ON T1.head_ID  =  T2.head_ID ORDER BY T1.age

In [324]:
df2_oos_350[df2_oos_350['correct'] == 0].iloc[0]

question              List the name, born state and age of the heads...
db_id                                             department_management
query                 SELECT name ,  born_state ,  age FROM head ORD...
schema                CREATE TABLE "department" ("Department_ID" int...
open_ai_prompt        Schema: CREATE TABLE "department" ("Department...
open_ai_completion     SELECT name ,  born_state ,  age FROM head OR...
model_response         SELECT T1.Name ,  T1.born_state ,  T1.age FRO...
correct                                                               0
Name: 1, dtype: object

In [322]:
df2[df2['query'].str.len() == df2['query'].str.len().max()]['query'].iloc[0]

"SELECT T1.stu_fname FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num JOIN CLASS AS T3 ON T2.class_code  =  T3.class_code JOIN course AS T4 ON T3.crs_code  =  T4.crs_code JOIN department AS T5 ON T5.dept_code  =  T4.dept_code WHERE T5.dept_name  =  'Accounting' INTERSECT SELECT T1.stu_fname FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num JOIN CLASS AS T3 ON T2.class_code  =  T3.class_code JOIN course AS T4 ON T3.crs_code  =  T4.crs_code JOIN department AS T5 ON T5.dept_code  =  T4.dept_code WHERE T5.dept_name  =  'Computer Info. Systems'"

## Test only on single table queries

In [330]:
df2_is_350[~df2_is_350['open_ai_completion'].str.contains('JOIN')]['correct'].mean()

0.9802371541501976

In [331]:
df2_oos_350[~df2_oos_350['open_ai_completion'].str.contains('JOIN')]['correct'].mean()

0.34497816593886466